-- phpMyAdmin SQL Dump
-- version 5.0.3
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Apr 14, 2021 at 04:11 PM
-- Server version: 10.4.14-MariaDB
-- PHP Version: 7.4.11

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `news_portal`
--

-- --------------------------------------------------------

--
-- Table structure for table `admin_infos`
--

CREATE TABLE `admin_infos` (
  `a_id` int(5) NOT NULL,
  `a_name` varchar(40) NOT NULL,
  `a_email` varchar(40) NOT NULL,
  `a_pass` varchar(500) NOT NULL,
  `a_phone` varchar(20) NOT NULL,
  `a_reg` datetime(6) NOT NULL DEFAULT current_timestamp(6),
  `a_status` varchar(10) NOT NULL DEFAULT 'Valid',
  `message_id` int(11) NOT NULL DEFAULT 111
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `admin_infos`
--

INSERT INTO `admin_infos` (`a_id`, `a_name`, `a_email`, `a_pass`, `a_phone`, `a_reg`, `a_status`, `message_id`) VALUES
(1, 'Hafizur Rahman', 'hafizur@news.com', '123456', '01680735420', '2021-03-05 16:16:20.000000', 'Valid', 101);

-- --------------------------------------------------------

--
-- Table structure for table `chat`
--

CREATE TABLE `chat` (
  `chat_id` int(100) NOT NULL,
  `sender_id` int(50) NOT NULL,
  `sender_uname` varchar(30) NOT NULL,
  `receiver_id` int(50) DEFAULT NULL,
  `receiver_uname` varchar(30) DEFAULT NULL,
  `chat_text` text NOT NULL,
  `chat_time` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `chat`
--

INSERT INTO `chat` (`chat_id`, `sender_id`, `sender_uname`, `receiver_id`, `receiver_uname`, `chat_text`, `chat_time`) VALUES
(73, 8, 'hafizur', 101, 'admin', 'Hello admin', '2021-03-07 07:41:20'),
(74, 101, 'admin', 8, 'hafizur', 'Hello hafizur how are you', '2021-03-07 07:43:04'),
(75, 101, 'admin', 8, 'hafizur', 'what r u doing', '2021-03-07 07:45:37'),
(76, 11, 'Null P', 8, 'hafizur', 'Hello Hafizur', '2021-03-07 07:49:38'),
(77, 8, 'hafizur', 11, NULL, 'Hello Null P', '2021-03-07 07:54:51'),
(78, 8, 'hafizur', 101, NULL, 'h', '2021-03-07 07:56:56');

-- --------------------------------------------------------

--
-- Table structure for table `contact`
--

CREATE TABLE `contact` (
  `contact_id` int(100) NOT NULL,
  `c_name` varchar(30) NOT NULL,
  `c_email` varchar(50) NOT NULL,
  `c_message` varchar(1000) NOT NULL,
  `c_time` datetime(6) NOT NULL DEFAULT current_timestamp(6)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `news`
--

CREATE TABLE `news` (
  `n_id` int(10) NOT NULL,
  `n_title` varchar(100) NOT NULL,
  `short_des` varchar(200) NOT NULL,
  `description` varchar(2000) NOT NULL,
  `author` varchar(30) NOT NULL,
  `category` varchar(30) NOT NULL,
  `file` varchar(400) DEFAULT NULL,
  `date_pub` datetime(6) NOT NULL DEFAULT current_timestamp(6),
  `time_visited` int(10) NOT NULL,
  `valid` varchar(10) NOT NULL DEFAULT 'Yes'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `news`
--

INSERT INTO `news` (`n_id`, `n_title`, `short_des`, `description`, `author`, `category`, `file`, `date_pub`, `time_visited`, `valid`) VALUES
(40, 'অস্ট্রেলিয়ায় বেঙ্গালুরুর ‘ফেরিওয়ালা’ ছিলেন কোহলি', 'অস্ট্রেলিয়ায় তিনি গিয়েছিলেন ভারতের হয়ে খেলতে। প্রথম সন্তানের জন্মের সময় বলিউড অভিনেত্রী স্ত্রী আনুশক', 'ওয়ানডে আর টি-টোয়েন্টি খেলেছিলেন তিনটি করে, টেস্ট একটি। এর মধ্যে ওয়ানডে সিরিজে হারলেও তাঁর নেতৃত্বে ভারত টি-টোয়েন্টি সিরিজ জিতেছে। কোহলির খেলা একমাত্র টেস্টে অবশ্য অ্যাডিলেডে ভারতের কপালে জুটেছে লজ্জাজনক হার, টেস্টের দ্বিতীয় ইনিংসে ৩৬ রানে অলআউট হয়েছিল। এরপর কোহলিকে ছাড়াই ভারত অজিঙ্কা রাহানের অধীন টেস্ট সিরিজে অবিশ্বাস্য রূপকথা লিখেছে, ঘুরে দাঁড়িয়ে অস্ট্রেলিয়ার মাটিতে টানা দ্বিতীয় টেস্ট সিরিজ জিতেছে...এ নিয়ে শব্দ খরচাও কম হয়নি!\r\n\r\nসে অন্য আলোচনা। এখন কোহলির অস্ট্রেলিয়া সফরের কথা কেন আসছে? আইপিএলে কোহলির দল রয়্যাল চ্যালেঞ্জার্স বেঙ্গালুরুতে (আরসিবি) এবার যোগ দেওয়া অস্ট্রেলিয়ান অলরাউন্ডার গ্লেন ম্যাক্সওয়েলের কথার পর। ‘ম্যাক্সি’র কথায় মনে হচ্ছে, অস্ট্রেলিয়া সফরেও ভারতীয় দলের পাশাপাশি বেঙ্গালুরুর কথাও কোহলির মাথায় ছিল। একভাবে দেখলে, কোহলি যেন সেখানে বেঙ্গালুরুর ফেরি করেছিলেন! কীভাবে? ম্যাক্সওয়েলকে সেই সফরেই বেঙ্গালুরুতে খেলার আমন্ত্রণ জানিয়ে রেখেছিলেন ভারত অধিনায়ক!', 'খেলা ডেস্ক', 'Sports', '1618404292prothomalo-bangla_2021-04_5535f587-e6e8-4d9a-8f7c-43925dab57a9_koh.jpg', '2021-04-14 18:44:52.789272', 0, 'Yes'),
(41, 'কোহলির সিংহাসন এখন বাবরের', 'টি-টোয়েন্টি র‌্যাঙ্কিংয়ে অনেক দিনই ১ নম্বর ব্যাটসম্যান ছিলেন বাবর আজম। পাকিস্তানি ব্যাটসম্যান এবার ১', 'দক্ষিণ আফ্রিকার বিপক্ষে ওয়ানডে সিরিজের পারফরম্যান্স দিয়েই শীর্ষে উঠেছেন বাবর। সিরিজের তিন ম্যাচে বাবর করেছেন ১০৩, ৩১ ও ৯৪ রান। সেঞ্চুরিয়নে শেষ ম্যাচে বাবরের ৮২ বলের ইনিংসে ভর করেই ৩২০ রান করে পাকিস্তান। ম্যাচটি ২৮ রানে জিতে তিন ম্যাচের সিরিজটা ২-১ ব্যবধানে জিতে নেয় পাকিস্তান।\r\n\r\n সিরিজ শুরুর আগে ৮৩৭ রেটিং পয়েন্ট নিয়ে দুইয়ে ছিলেন বাবর। বিরাট কোহলির চেয়ে সে সময়ে ২০ পয়েন্ট পিছিয়ে ছিলেন পাকিস্তান অধিনায়ক। সিরিজ শেষে কোহলির চেয়ে ৮ পয়েন্ট এগিয়ে যাওয়া বাবরের পয়েন্ট এখন ৮৬৫। বিরাট কোহলি ওয়ানডে র‌্যাঙ্কিংয়ে শীর্ষে ছিলেন ২০১৭ সালের অক্টোবর থেকে। দক্ষিণ আফ্রিকার এবি ডি ভিলিয়ার্সকে পেছনে ফেলে শীর্ষে উঠেছিলেন ভারতের বর্তমান অধিনায়ক।\r\n\r\nপাকিস্তানের চতুর্থ ব্যাটসম্যান হিসেবে ওয়ানডে র‌্যাঙ্কিংয়ের শীর্ষে উঠলেন বাবর। তাঁর আগে পাকিস্তানি ব্যাটসম্যানদের মধ্যে শীর্ষে ছিলেন জহির আব্বাস (১৯৮৩-৮৪), জাভেদ মিয়াঁদাদ (১৯৮৮-৮৯) ও মোহাম্মদ ইউসুফ (২০০৩)।\r\nওয়ানডে র‌্যাঙ্কিংয়ে শীর্ষে ওঠার পর ইএসপিএনক্রিকইনফোকে বাবর বলেন, এই অর্জন দায়িত্ব বাড়িয়ে দিয়েছে তাঁর, ‘ক্যারিয়ারে আরেকটি মাইলফলক যোগ হলো। লম্বা সময়ের জন্য র‌্যাঙ্ক', 'খেলা ডেস্ক', 'Sports', '1618404566prothomalo-bangla_2021-04_5a8c9429-30ac-4ae2-85d9-880a98543ce2_004215_01_02.jpg', '2021-04-14 18:49:26.864281', 0, 'Yes'),
(42, 'দুর্নীতির দায়ে ৮ বছর নিষিদ্ধ হিথ স্ট্রিক', 'জিম্বাবুয়ের সাবেক অধিনায়ক ও দেশটির কিংবদন্তি পেসার হিথ স্ট্রিককে ৮ বছর নিষিদ্ধ করেছে আইসিসি। \r\n\r\nদুর', 'খেলা ছাড়ার পর কোচিংয়ে জড়ান স্ট্রিক। ২০১৬ থেকে ২০১৮—এ সময় জিম্বাবুয়ে দলের কোচের দায়িত্ব ছাড়াও ঘরোয়ায় বেশ কিছু দলের দায়িত্ব পালন করেন তিনি। এ সময়কালে বেশ কিছু ম্যাচ নিয়ে তাঁর বিরুদ্ধে তদন্ত শুরু করে আইসিসি। এর মধ্যে রয়েছে বেশ কিছু আন্তর্জাতিক ম্যাচ।\r\nএ ছাড়াও বাংলাদেশ প্রিমিয়ার লিগ (বিপিএল), ইন্ডিয়ান প্রিমিয়ার লিগ (আইপিএল) ও আফগানিস্তান প্রিমিয়ার লিগেও (এপিএল) কিছু ম্যাচ নিয়ে তদন্ত করা হয়। \r\n\r\nস্ট্রিক এসব টুর্নামেন্টে দলের সঙ্গে থাকতে, দুর্নীতিবাজদের দুর্নীতি করার সুযোগ করে দিয়েছেন বলে ধারণা করা হয়েছিল। শুরুতে তিনি এই অভিযোগের বিরুদ্ধে অবস্থান নিলেও পরে দোষ স্বীকার করে নেন। \r\nআইসিসির দুর্নীতি দমন নীতিমালায় পাঁচটি ধারা ভাঙার অভিযোগ স্বীকার করে নেন জিম্বাবুয়ের হয়ে ৬৫ টেস্ট ও ১৮৯ ম্যাচ খেলা স্ট্রিক। \r\n\r\nটেস্টে ২১৬ এবং ওয়ানডেতে ২৩৯ উইকেট নেন তিনি। ২০১৪ থেকে ২০১৬ সাল পর্যন্ত বাংলাদেশ দলের বোলিং কোচ ছিলেন ৪৭ বছর বয়সী সাবেক এ পেসার। ২০১৬ সালের অক্টোবরে জিম্বাবুয়ে কোচের দায়িত্ব নেন তিনি।\r\n\r\nজিম্বাবুয়েকে বিশ্বকাপে তুলতে ব্যর্থ হওয়ায় কোচের চাকরি হারান স্ট্রিক। ২০১৮ সালে আইপিএলে কলকাতা নাইট রাইডার্স', 'খেলা ডেস্ক', 'Sports', 'prothomalo-bangla_2021-04_def7dadb-3e23-40f3-bb92-2232e65a582b_Heath_streak130915.jpg', '2021-04-14 18:53:57.242363', 5, 'Yes'),
(43, 'কোয়ারেন্টিন শেষ আজ, মাঠে ফেরার অপেক্ষায় মুমিনুলরা', 'শ্রীলঙ্কায় আজ রাতে শেষ হবে বাংলাদেশের ক্রিকেটারদের তিন দিনের বাধ্যতামূলক কোয়ারেন্টিন। প্রথম পরীক্ষায় গত সোমবার বিকেলে শ্রীলঙ্কা পৌঁছে এখন কোয়ারেন্টিনে বাংলাদেশ টেস্ট দলের ক্রিকেটাররা। আজ রাতে শেষ হবে ', 'আগামীকাল থেকেই অনুশীলন করতে পারবেন মুমিনুল-মুশফিকরা।\r\n\r\nশ্রীলঙ্কায় মুমিনুলরা কোয়ারেন্টিনে আছেন নিগোম্বোর জেট উইং ব্লু হোটেলে। বাংলাদেশ দলের সব সদস্যকে হোটেলে পৌঁছেই করোনা পরীক্ষার জন্য নমুনা দিতে হয়েছে। দলের একটি সূত্র জানিয়েছে, প্রথম পরীক্ষায় সবাই নেগেটিভ রিপোর্ট পেয়েছেন। আজ আবার দ্বিতীয়বার করোনা পরীক্ষার জন্য নমুনা নেওয়া হয়েছে।\r\nক্রিকেটারদের প্রথম তিন দিন হোটেলকক্ষ থেকে বের হওয়ার কোনো সুযোগ নেই। অনেকেই কোয়ারেন্টিনের এই অলস সময়ে নিজেদের ব্যস্ত রাখছেন জিম করে। যাঁর যাঁর খাবার প্রত্যেকের কক্ষ পৌঁছে দেওয়া হচ্ছে। অনেকেই রোজা রেখেছেন। হোটেলকক্ষ থেকে ভারত মহাসাগরের নয়নাভিরাম দৃশ্যের ছবি, ভিডিও অনেক ক্রিকেটারের সামাজিক যোগাযোগমাধ্যমে দেখা গেছে। আজ তরুণ ওপেনার সাইফ হাসান নিজের ইনস্টাগ্রামে লিখেছেন, ‘আর এক দিন বাকি কোয়ারেন্টিনের। শেষ হলেই এই সমুদ্রসৈকতে হাঁটব।’\r\n১৭-১৮ এপ্রিল কাতুনায়েকে ভেন্যুতে নিজেদের মধ্যে দুই দিনের প্রস্তুতি ম্যাচ খেলবে বাংলাদেশ ', 'ক্রীড়া প্রতিবেদক', 'Sports', '1618405338prothomalo-bangla_2021-04_02fca71e-66ba-4069-a017-c622ab5dd88b_Tamim_after_practice_with_Sujon_At_SBNCS___1.jpg', '2021-04-14 19:02:18.835714', 0, 'Yes'),
(44, 'ভারতে করোনায় বাতিল দশম শ্রেণির পরীক্ষা স্থগিত ', 'ভারতে দেশজুড়ে বেড়েছে করোনাভাইরাসের প্রকোপ। দেশটির ১১ রাজ্যে ভয়াবহ আকার ধারণ করেছে মারণ ভাইরাসের সং', 'আজ বুধবার সকালে (গত ২৪ ঘণ্টায়) ১ লাখ ৮৪ হাজার ৩৭২ জনের করোনার সংক্রমণ ধরা পড়ে। আর মৃত্যু হয়েছে ১ হাজার ২৭ জনের। এটি এক দিনের সর্বোচ্চ সংক্রমণের রেকর্ড।\r\n\r\nদেশে করোনা সংক্রমণের বাড়বাড়ন্তের পরিপ্রেক্ষিতে বোর্ডের পরীক্ষা পিছিয়ে দেওয়া বা বাতিলের দাবি করেছিলেন শিক্ষা-সংশ্লিষ্ট ব্যক্তিরা। এরই মধ্যে আজ বুধবার শিক্ষা মন্ত্রণালয়ের সঙ্গে বৈঠক করেন দেশটির প্রধানমন্ত্রী নরেন্দ্র মোদি। এই বৈঠকে পরীক্ষা বাতিল ও স্থগিতের সিদ্ধান্ত হয়। বৈঠকের পর জানানো হয়, দশম শ্রেণির পরীক্ষার ফল বোর্ডের তৈরি নীতিমালা ও মাপকাঠি অনুযায়ী নির্ধারণ করা হবে। আর করোনা পরিস্থিতি কেমন থাকে, তা দেখে পরে দ্বাদশ শ্রেণির পরীক্ষা কবে হবে, সেই সিদ্ধান্ত নেওয়া হবে। ভারতের শিক্ষা বোর্ড আগামী ১ জুন করোনা পরিস্থিতির পর্যালোচনা করবে।\r\n\r\nআগামী ৪ মে থেকে দুই শ্রেণিরই পরীক্ষা শুরু হওয়ার কথা ছিল। আর ১৪ জুন পর্যন্ত এ পরীক্ষা হওয়ার কথা ছিল।\r\n\r\nবৈঠকের পর সাংবাদিকদের ভারতের কেন্দ্রীয় শিক্ষামন্ত্রী রাম নরেশ পোখরিয়াল বলেন, পর্যালোচনার পরই দশম শ্রেণির শিক্ষার্থীদের পরের শ্রেণিতে ওঠার ব্যবস্থা হবে।\r\nএর আগে করোনার প্রকোপ বেড়ে যাওয়ায় সিবিএসইর এ বছর', 'প্রথম আলো ডেস্ক', 'International', '1618405664prothomalo-bangla_2021-04_5603695c-f785-4de5-b9c1-e6e2cacf8597_8aeba716-7d1d-4917-8f5e-e0b97e9c7532.jpg', '2021-04-14 19:07:44.795982', 0, 'Yes'),
(45, 'করোনার টিকার দ্বিতীয় ডোজ নিলেন পুতিন', 'রাশিয়ায় প্রেসিডেন্ট ভ্লাদিমির পুতিন নিজ দেশে উদ্ভাবিত করোনার টিকা নিয়েছেন বলে গত মাসেই খবর বেরিয়েছিল', 'রাশিয়ায় স্পুতনিক-ভিসহ তিনটি টিকার উদ্ভাবন ও অনুমোদন দেওয়া হয়েছে। এই তিন টিকার মধ্যে পুতিন কোনটি নিয়েছেন, তা বুধবার পর্যন্ত প্রকাশ করেনি ক্রেমলিন। পুতিনের টিকা নেওয়ার কোনো ছবিও প্রকাশ করা হয়নি।\r\nরাশিয়ায় উদ্ভাবিত করোনার তিন টিকার মধ্যে স্পুতনিক-ভিই সবচেয়ে আলোচিত। বেশ কয়েকটি দেশেও এই টিকা অনুমোদন পেয়েছে। সর্বশেষ ভারত স্পুতনিক ভি-এর অনুমোদন দিয়েছে।\r\n\r\nকরোনা মহামারিতে ক্ষতিগ্রস্ত শীর্ষ দেশগুলোর তালিকায় রাশিয়া পঞ্চম। এই মহামারির সার্বক্ষণিক তথ্য প্রকাশকারী ওয়েবসাইট ওয়ার্ল্ডোমিটারস ডট ইনফোর তথ্যমতে, রাশিয়ায় বুধবার পর্যন্ত ৪৬ লাখ ৬৬ হাজারের বেশি করোনা সংক্রমিত রোগী শনাক্ত হয়েছেন। এর মধ্যে মারা গেছেন ১ লাখ ৪ হাজার রোগী। সুস্থ হয়ে উঠেছেন ৪২ লাখ ৯১ হাজারের বেশি করোনা রোগী।\r\n\r\nরাশিয়ায় বুধবার করোনা সংক্রমিত নতুন রোগী শনাক্ত হয়েছেন ৮ হাজার ৩২৬ জন। এ দিন মারা গেছেন ৩৯৯ জন।', 'প্রথম আলো ডেস্ক', 'International', '1618405783prothomalo-bangla_2021-04_ab7a1b69-075e-4d38-aa8c-16edc88a23e0_RUSSIA.jpg', '2021-04-14 19:09:43.849809', 0, 'Yes'),
(46, '৯০ কোটি ডলার না দিলে জাহাজটি ছাড়বে না মিসর', 'সুয়েজ খালে আটকে পড়া পানামার পতাকাবাহী জাহাজটিকে জব্দ করেছে মিসর। গুরুত্বপূর্ণ নৌপথ আটকে দেশটিকে রাজস', 'গত মাসে প্রায় আড়াআড়িভাবে আটকে পড়েছিল ‘এভার গিভেন’ নামের জাহাজটি। এতে সুয়েজ খালে জাহাজ চলাচল বন্ধ হয়ে যায়। সুয়েজ খালের দুই প্রবেশমুখে জাহাজজট সৃষ্টি হয়। সমন্বিত নানা কৌশলের মাধ্যমে টানা প্রায় এক সপ্তাহ প্রচেষ্টার পর কনটেইনারবাহী জাহাজটি সরানো সম্ভব হয়। এর ফলে আবার চালু হয় সুয়েজ খাল।\r\n\r\nনৌ পরিবহন চলাচলের ডেটা কোম্পানি লয়েড লিস্ট জানায়, চারটি ফুটবল মাঠ থেকেও লম্বা জাহাজটি এশিয়া ও ইউরোপের মধ্যকার গুরুত্বপূর্ণ নৌপথটি আটকে দিয়েছিল। এর কারণে প্রতিদিন মিসর ১২ থেকে ১৫ মিলিয়ন ডলার রাজস্ব হারিয়েছে বলে খাল কর্তৃপক্ষ সূত্রে জানা গেছে।\r\n\r\nসরকারি সংবাদপত্র আল-আহরামকে সুয়েজ খাল কর্তৃপক্ষের (এসসিএ) প্রধান ওসামা রাবি বলেন, ‘৯০ কোটি ডলার ক্ষতিপূরণ দিতে ব্যর্থ হওয়ায় এমভি এভার গিভেন জব্দ করা হয়েছে।’ ইসমাইলিয়া ইকোনমিক কোর্টে রাবি জানান, নোঙর করা অবস্থায় এবং চলাচলের সময় জাহাজটির রক্ষণাবেক্ষণের খরচের ভিত্তিতে এ ক্ষতিপূরণ হিসাব করা হয়েছে।\r\nক্ষতিপূরণের এ অঙ্ক কীভাবে নির্ধারণ করা হয়েছে, সে বিষয়ে জাহাজটির মালিক জাপানি প্রতিষ্ঠান শোয়েই কিসেন কাইশাকে বিশদভাবে কিছু জানাননি ওসামা রাবি। তবে এসসিএর একটি সূত্র গতকাল মঙ্', 'প্রথম আলো ডেস্ক', 'International', '1618405854prothomalo-bangla_2021-04_1251db42-079c-4770-8a49-aaf3d94d0027_Egypt.jpg', '2021-04-14 19:10:55.077208', 8, 'Yes'),
(47, 'চুরি হয়ে গেছে বিশ্বের সবচেয়ে বড় খরগোশ', 'বাড়ির পাশ থেকে চুরি হয়ে গেছে বিশ্বের সবচেয়ে বড় খরগোশ। কে বা কারা প্রাণীটিকে চুরি করে নিয়ে গেছে, তা বলতে পারছেন না মালিক অ্যানেথ এডওয়ার্ডস। প্রিয় প্রাণীটি খুঁজে পেতে পুলিশের দ্বারস্থ হয়েছেন তিনি।', 'বাড়ির পাশ থেকে চুরি হয়ে গেছে বিশ্বের সবচেয়ে বড় খরগোশ। কে বা কারা প্রাণীটিকে চুরি করে নিয়ে গেছে, তা বলতে পারছেন না মালিক অ্যানেথ এডওয়ার্ডস। প্রিয় প্রাণীটি খুঁজে পেতে পুলিশের দ্বারস্থ হয়েছেন তিনি। ঘোষণা করেছেন এক হাজার ব্রিটিশ পাউন্ড পুরস্কার। তবে এখনো খোঁজ মেলেনি হারিয়ে যাওয়া খরগোশটির। পুলিশ হন্যে হয়ে সন্ধান চালিয়ে যাচ্ছে।\r\n\r\nসোমবার দ্য গার্ডিয়ান–এর প্রতিবেদনে বলা হয়েছে, বিশ্বের সবচেয়ে বড় খরগোশটির নাম দারিয়ুস। লম্বায় ১২৯ সেন্টিমিটার। বিশাল আকারের কারণে ২০১০ সালে গিনেস ওয়ার্ল্ড রেকর্ডসে নাম ওঠে এটির। বিশ্বের সবচেয়ে বড় খরগোশের স্বীকৃতি পায় দারিয়ুস।\r\n\r\n মালিক অ্যানেথ এডওয়ার্ডসের সঙ্গে যুক্তরাজ্যের উরসেস্টারশায়ারে বসবাস করত খরগোশটি। স্থানীয় ওয়েস্ট মার্সিয়া পুলিশ বলছে, গত শনিবার রাতে বাড়ির পাশের বাগানে ছিল দারিয়ুস। সেখান থেকেই গায়েব হয়ে যায় বিশালাকারের খরগোশটি। ওই বাগানের চারপাশ বেড়া দিয়ে ঘেরা ছিল। খরগোশটির একা একা বেরিয়ে যাওয়ার সুযোগ ছিল না। এ কারণে এটি চুরি হয়ে গেছে বলে ধারণা পুলিশের।', 'প্রথম আলো ডেস্ক', 'International', '1618406199prothomalo-bangla_2021-04_3f4cd9c2-0eae-4ab6-98e2-2b27fd0c0fc2_rabbit.jpg', '2021-04-14 19:16:39.238911', 6, 'Yes'),
(48, 'খ্যাপা মেজর এবার স্কুলে', 'প্রিয় পোষা কুকুর মেজরকে নিয়ে বেশ ভালোই বিপাকে পড়েছেন যুক্তরাষ্ট্রের প্রেসিডেন্ট জো বাইডেন। কিছুতেই হোয়াইট হাউসের জীবনের সঙ্গে মানিয়ে নিতে পারছে না জার্মান শেফার্ড জাতের কুকুরটি। তাই এবার তাকে পাঠানো হ', 'প্রিয় পোষা কুকুর মেজরকে নিয়ে বেশ ভালোই বিপাকে পড়েছেন যুক্তরাষ্ট্রের প্রেসিডেন্ট জো বাইডেন। কিছুতেই হোয়াইট হাউসের জীবনের সঙ্গে মানিয়ে নিতে পারছে না জার্মান শেফার্ড জাতের কুকুরটি। তাই এবার তাকে পাঠানো হচ্ছে ‘বিদ্যালয়ে’। সেখানে সে প্রেসিডেন্টের পোষা কুকুরের মতো আচরণ শিখবে।\r\n\r\nজো বাইডেন যুক্তরাষ্ট্রের প্রেসিডেন্ট হিসেবে শপথ নেন গত ২০ জানুয়ারি। এর আগপর্যন্ত ডেলাওয়ার অঙ্গরাজ্যে বাইডেন দম্পতির বাসাই ছিল তিন বছর বয়সী মেজরের ঠিকানা। সেখানে এ দম্পতির অপর পোষা কুকুর চ্যাম্পের সঙ্গে খেলাধুলা করে দিন পার হতো মেজরের। চ্যাম্পের বয়স এখন ১২ বছর।\r\n\r\nজো বাইডেন শপথ নেওয়ার পর তিনি ও তাঁর স্ত্রীর সঙ্গে মেজর ও চ্যাম্পও হোয়াইট হাউসে বসতি গাড়ে। কিন্তু কুকুর দুটি হোয়াইট হাউসের পরিবেশের সঙ্গে মানিয়ে নিতে পারেনি। এত এত মানুষ আর প্রটোকলের কারণে মেজরের তো মেজাজই বিগড়ে যায়। একদিন কামড়ে দেয় এক কর্মীকে। ফলে কুকুর দুটিকে আবারও ডেলাওয়ারে বাইডেনের বাড়িতে পাঠানো হয়। ব্যবস্থা করা হয় প্রশিক্ষণের।\r\n\r\nপ্রশিক্ষণ শেষে কয়েক সপ্তাহ আগেই হোয়াইট হাউসে ফিরেছে মেজর ও চ্যাম্প। এর মধ্যেই আবার এক কর্মীকে কামড়ে দিয়েছে মেজর। আর এ কারণেই তাকে এবার পাঠানো হবে প্রশিক্ষণ স্কুলে। তবে চ্যাম্প থাকবে হোয়াইট হাউসে। মেজরের কাণ্ডের কারণে আগেরবারের মতো এবার আর তাকে নির্বাসিত হতে হবে না।\r\n\r\n', 'এএফপি', 'International', '1618406322prothomalo-bangla_2021-04_771b8d7f-8e26-40e7-a82b-c28ae7ec41f3_1_1_FILES_US_POLITICS_BIDEN_DOGS_OFFBEAT_204131.jpg', '2021-04-14 19:18:42.479268', 0, 'Yes'),
(49, 'চাঁদে প্রথম মানুষ', '১৯৬৯ সালের ১৬ জুলাইয়ের সকাল। যুক্তরাষ্ট্রের কেপ কেনেডি স্পেস সেন্টারের আশপাশের কয়েক কিলোমিটার লোকে লোকারন্য। গত রাত থেকেই কার, জিপ, বাস, নৌকা এমনকি ছোট ছোট বিমানও গাদাগাদি অবস্থা গোটা এলাকা।', '১৯৬৯ সালের ১৬ জুলাইয়ের সকাল। যুক্তরাষ্ট্রের কেপ কেনেডি স্পেস সেন্টারের আশপাশের কয়েক কিলোমিটার লোকে লোকারন্য। গত রাত থেকেই কার, জিপ, বাস, নৌকা এমনকি ছোট ছোট বিমানও গাদাগাদি অবস্থা গোটা এলাকা। অনেকেই ছোট ছোট তাবু খাটিয়ে অস্থায়ী আবাস বানিয়ে নিয়েছেন। কেউ কেউ খোলা আকাশের নিচেই আছেন বহাল তবিয়তে। হাতে ক্যামেরা, দুরবীন, রেডিও নিয়ে কৌতুহলে অধীর অপেক্ষা আর উত্তেজনার প্রহর গুনছেন তারা।\r\n\r\nএদের বেশিরভাগই এসেছে আনন্দ-উল্লাস করতে। কেউ কেউ হাতে প্ল্যাকার্ড, ব্যানার নিয়ে এসেছে মহাকাশ খাতে মার্কিন সরকারের বিপুল অর্থ অপচয়ের বিক্ষোভ-প্রতিবাদ জানাতে। কিন্তু পক্ষ হোক আর বিপক্ষ হোক, সেদিন সেখানে উপস্থিত সবাই জানত, তারা আজ মানবজাতির অনেক বড় এক ইতিহাসের সাক্ষী হতে যাচ্ছেন। এ এমন এক ইতিহাস যা যুগ যুগ ধরে বলে গেলেও পুরোনো হবে না।\r\n\r\nকিছুক্ষণ পরেই দুঃসাহসী তিন নভোচারীকে নিয়ে প্রায় তিন লাখ ৮৪ হাজার কিলোমিটার দূরের চাঁদের পানে ছুটে যাবে অ্যাপোলো ১১ নামের নভোযান। শুধু তাই নয়, মানব ইতিহাসে এবারই প্রথম পৃথিবীর বাইরে পা রাখবে মানুষ, চরকা কাটা চাঁদের বুড়ির দেশে পা রাখবে। হ্যাঁ, যন্ত্র নয়, আস্ত জলজ্যান্ত মানুষ। এর মাধ্যমেই সেদিন মহাকাশ প্রতিযোগিতায় চির প্রতিদ্বন্দ্বী সোভিয়েত ইউনিয়নকে দাঁত ভাঙা জবাব দেবে যুক্তরাষ্ট্র। তাই গোটা মার্কিনজাতি (নাকি মানবজাতি) যেনো কল্পনার ডানায় সেদিন তিন নভোচারী- নীল আর্মস্ট্রং, বাজ অলড্রিন ও মাইকেল কলিন্সের সাথে চাঁদের পথে রওয়ানা হয়েছিল।\r\n\r\nস্থানীয় ঘড়িতে ৯টা বেজে ২৩ মিনিট। কেপ কেনেডির দিগন্তরেখায় আকাশমুখি করে রাখা রকেটের তলদেশে উজ্জ্বল আলো জ্বলে উঠতে শুরু করল। তীব্র আগুনের হলকার সাথে সাদা ধোয়ায় আচ্ছন্ন হয়ে যেতে লাগল চারদিক। ধুমকেতুর মত লেজে আগুনেপুচ্ছ রেখে ধীরে ধীরে আকাশের দিকে ছুটতে শুরু করল স্যাটার্ন ভি রকেট। ক্রমেই বাড়তে লাগল তার বেগ। রকেটটির ওপরের দিকে বিশেষ কায়দায় বসানো হয়েছে কমান্ড মডিউল ও লুনার মডিউল। তার মধ্যেই তখন বসে দাঁতে দাঁত চেপে মহাকর্ষের শক্ত বাধন ছিন্ন করছেন তিন নভোচারী।\r\n\r\nপৃথিবীর মহাকর্ষের মায়া কাটিয়ে মহাশূন্যে অ্যাপোলো ১১-কে উঠার দৃশ্য দেখে নিচে দাঁড়িয়ে থাকা হাজার হাজার মানুষ উল্লাসে ফেটে পড়ল। কেউ কেউ অবশ্য আবেগের ভার সইতে না পেরে কেঁদে ফেলতেও দ্বিধা করল না। ঠিক তখন রকেটের মাথায় সুরক্ষিত নিয়ন্ত্রণকক্ষে বসে থাকা তিন নভোচারীর উত্তেজনা এখন অনেকটাই শান্ত হয়', 'আবুল বাসার', 'Technology', '1618406689prothomalo_import_media_2020_07_20_42347c3197b58a559725acdd3612987b-5f15462d50876.jpg', '2021-04-14 19:24:49.991987', 0, 'Yes'),
(50, 'মোবাইলের টাচ স্ক্রিন কাজ করে কীভাবে?', 'মোবাইল আমরা কে না ব্যবহার করি। আর এখন স্মার্টফোনের যুগে টাচ স্ক্রিন মোবাইল ছাড়া যেন চলেই না। টাচ স্ক্রিন মোবাইল দিয়ে নিয়মিত অন্য কাউকে কল করছি বা মেসেজ করছি। কিন্তু কখনো কি ভেবেছি, এই টাচ স্ক্রিন আসলে', 'মোবাইল অনেক আগে উদ্ভাবন হলেও টাচ স্ক্রিন মোবাইলের প্রথম উদ্ভাবন হয় ১৯৯২ সালে। এটি মোবাইলের ক্ষেত্রে একটি ভিন্নধারা নিয়ে আসে। মূলত টাচ স্ক্রিন হচ্ছে প্রদর্শন পর্দা। যেটি স্পর্শ পর্দা হিসেবেও কাজ করে। এই পর্দা সংবেদনশীল, যা একধরনের ইনপুট ডিভাইস হিসেবে কাজ করে। এর ওপর আঙুলের প্রিন্ট, নখ বা যেকোনো কাঠি দিয়ে চাপ দিলেই কাজ করে।\r\n\r\nবর্তমানে রেজিস্টিভ ও ক্যাপাসিটিভ নামের দুটি টাচ স্ক্রিন বেশি ব্যবহূত হয়। এর মধ্যে মোবাইলে ক্যাপাসিটিভ টাচ স্ক্রিন ব্যবহূত হচ্ছে। এ ধরনের টাচ স্ক্রিন পুরোটাই নির্ভরশীল মানবদেহের ইলেকট্রিক্যাল ইমপালসের ওপর। আমাদের দেহে বৈদ্যুতিক চার্জ না থাকলে এই টাচ স্ক্রিন কাজ করত না।\r\n\r\nটাচ স্ক্রিন কীভাবে কাজ করে, তা জানতে হলে প্রথমেই জানতে হবে মোবাইলের স্ক্রিন সম্পর্কে। মোবাইল স্ক্রিনের ওপরের অংশ হচ্ছে স্পর্শ শনাক্তকরণ অংশ এবং এটি এলসিডি স্ক্রিন। এটি মূলত মোবাইলের ব্যাটারি এবং সার্কিটের ওপরের অংশ। মোবাইল স্ক্রিনে দুই স্তরবিশিষ্ট স্ক্রিন থাকে। মোবাইলের ভেতরের সার্কিট এই দুটি স্ক্রিনের ভেতর দিয়ে একগুচ্ছ চিকন তারের সঙ্গে সংযুক্ত থাকে। এর মাধ্যমে সার্কিট মোবাইলের স্ক্রিনকে সক্রিয় করে। মোবাইলের ওপরে যে গ্লাসটি থাকে, সেটি আসলে মোবাইলকে নানা ধরনের আঘাত থেকে সুরক্ষিত রাখে। তার নিচে যে গ্লাস বা স্ক্রিন থাকে, তার সঙ্গেই ভেতরের তারগুলো যুক্ত থাকে। এখানে মূলত দুটি তারের স্তর থাকে। এই দুটো মিলে একটা গ্রিড প্যাটার্ন তৈরি করে। দুটি তার সব সময় পরস্পর বিপরীতধর্মী চার্জ বহন করে।\r\n\r\nযখন আমাদের হাতের আঙুল মোবাইল স্ক্রিনের ওপর স্পর্শ করে, তখন স্তরগুলোর মধ্যে চার্জের আদান-প্রদান হয়। চার্জের সমতা রক্ষার জন্য চার্জের আদান-প্রদানের ক্ষেত্রে তৃতীয় মাধ্যম হিসেবে কাজ করে হাতের আঙুল।\r\n\r\nযখন স্ক্রিনে টাচ করা হয়, তখন ওই আঙুলকে একটি বৈদ্যুতিক ক্ষেত্রের মধ্যে প্রবেশ করানো হয়। আঙুলের রক্ত ও কোষ পানি দিয়ে পূর্ণ। এর মধ্যে চার্জিত পরমাণু দ্রবীভূত থাকে। যেমন ধনাত্মক আয়ন সোডিয়াম এবং পটাশিয়াম আর ঋণাতক আয়ন ক্লোরাইড। যখন আঙুলকে বৈদ্যুতিক ক্ষেত্রের মধ্যে প্রবেশ করানো হয়, তখন এই ক্ষেত্রটি চার্জগুলোকে প্রস্তুত করতে থাকে এবং পজিটিভ তারের দিকে নেগেটিভ আয়নগুলো আসে এবং পজিটিভ আয়নগুলো দূরে চলে যায়।\r\n\r\nসব অতিরিক্ত চার্জ আঙুলের মধ্যে সংগঠিত হয়। যেহেতু বৈদ্যুতিক ক্ষেত্র খুব শক্তিশালী, তাই এটি অনেক চার্জ ব্যাটারি', 'আহসান মাহমুদ', 'Technology', '1618406806prothomalo_import_media_2019_10_03_25c62ead440fe62e70d20279240a3927-5d95a309b6dfb.jpg', '2021-04-14 19:26:46.996636', 3, 'Yes'),
(51, 'ইলেকট্রনিক পাঠশালা ৩', 'সাইকেল চালাতে শিখতে হলে কেবল তত্ত্ব শিখলেই হয় না, সত্যিকারে চালিয়েই শিখতে হয়। একইভাবে ইলেকট্রনিকস শিখতে হলে তত্ত্বের পাশাপাশি হাতে-কলমে সার্কিট তৈরি করতে হয়। ', 'সাইকেল চালাতে শিখতে হলে কেবল তত্ত্ব শিখলেই হয় না, সত্যিকারে চালিয়েই শিখতে হয়। একইভাবে ইলেকট্রনিকস শিখতে হলে তত্ত্বের পাশাপাশি হাতে-কলমে সার্কিট তৈরি করতে হয়। সার্কিটের বিভিন্ন বিন্দুতে পরিমাপ করে তত্ত্বের সঙ্গে তার মিল-অমিলের কারণ চিন্তা করে খুঁজে বের করতে হয়। আবার কেবল সার্কিট তৈরিই নয়, কীভাবে তাকে খোলসবন্দী করে অন্য সবার ব্যবহারের উপযোগী করা যায়, তা-ও শিখতে হয়। নইলে ওই সার্কিট কোনো কাজে আসবে না। এ পাঠশালায় তাই কিছু কাজের সার্কিট বানানো শেখানো হবে। সেই সঙ্গে তার প্রয়োগ ও প্রয়োজনীয় তত্ত্বও ধাপে ধাপে আলোচনা করা হবে। তাতে একসঙ্গে সব কটি দিকই শেখা হয়ে যাবে।\r\n\r\nথার্মিস্টরের ভেতরের কথা\r\n\r\nগত দুই পর্বে আমরা একটি থার্মিস্টর ব্যবহার করে একটি থার্মোমিটার বানানোর কৌশল ও ক্যালিব্রেট করতে শিখেছিলাম। থার্মোমিটার বানানোর ওই পর্ব বিস্তারিত পাওয়া যাবে বিজ্ঞানচিন্তার ওয়েবসাইট bigganchinta.com-এ। এ পর্বে আমরা থার্মিস্টরের মৌলিক গঠন, ধর্ম ইত্যাদি নিয়ে আলোচনা করব। এটি মূলত একটি কঠিন বস্তু ও বিদ্যুৎ পরিবহনের ধর্মে এটি একটি সেমিকন্ডাক্টর বা অর্ধপরিবাহী পদার্থ। অর্থাত্ এর বিদ্যুৎ পরিবহনক্ষমতা সুপরিবাহী ধাতু (যেমন তামা, অ্যালুমিনিয়াম ইত্যাদি) থেকে কম, আবার কুপরিবাহী বস্তু (যেমন প্লাস্টিক, শুকনো কাঠ) ইত্যাদি থেকে বেশি। থার্মিস্টরে যাওয়ার আগে কঠিন বস্তুতে কীভাবে বিদ্যুত্ পরিবাহিত হয়, তা নিয়ে একটু আলোচনা করা যাক।\r\nকঠিন পদার্থের পরমাণুগুলো একটির সঙ্গে অপরটি জোরালোভাবে লেগে থাকে। তাই তারা স্থান পরিবর্তন করতে পারে না। পরমাণুগুলোর চারদিকে ঘূর্ণমান ইলেকট্রন থাকে। এখান থেকে কিছু ইলেকট্রনকে যদি যার যার পরমাণুর কক্ষপথ থেকে কোনোভাবে সরিয়ে ফেলা যায়, তবে তা মুক্ত ইলেকট্রন (free electron) হিসেবে এক পরমাণু থেকে অন্য পরমাণুতে লাফ দিয়ে চলাচল করতে পারে। এখন ছবি-১-এর মতো একটি কঠিন বস্তুর দুদিকে দুটি ধাতব পাত লাগিয়ে সে দুটিকে একটি ব্যাটারির দুই প্রান্তের সংযোগ দেওয়া হলে ব্যাটারির ভোল্টেজের কারণে বস্তুটির মধ্যে একটি বৈদ্যুতিক বলক্ষেত্র (electric field) তৈরি হয়। বৈদ্যুতিক বলক্ষেত্র বলতে আমরা বুঝি এমন একটি ক্ষেত্র, যেখানে একটি বৈদ্যুতিক চার্জ রেখে দিলে সেটি কোনো একদিকে নড়ার জন্য একটি বল বা চাপ অনুভব করবে। ছবিতে দেখতে পাচ্ছি, ব্যাটারির নেগেটিভ প্রান্ত বস্তুটির বাঁদিকে ও পজিটিভ প্রান্ত বস্তুটির ডান দিকে সংযোগ দেওয়া', 'ড. খোন্দকার সিদ্দিক-ই রব্বানী', 'Technology', '1618406904prothomalo-bangla_2021-03_fdfdd171-7e34-4040-8d2a-138502e23f84_Make_an_Arduino_Temperature_Sensor_Thermistor_Tutorial_LCD_Output_of_Temperature_Readings.jpg', '2021-04-14 19:28:24.866138', 0, 'Yes'),
(52, 'অ্যাপে আকাশ চিনুন সহজে', 'আকাশের সব তারা কি চেনা সম্ভব? হ্যাঁ, সম্ভব। পৃথিবীর যেমন ম্যাপ আছে, তেমনি আছে আকাশেরও ম্যাপ। এ তথ্যপ্রযুক্তির যুগে সেটা এখন চলে এসেছে স্মার্টফোনে। Sky Map নামের অ্যান্ড্রয়েড ফোন অথবা আইফোনে অ্যাপটি দি', 'আকাশের সব তারা কি চেনা সম্ভব? হ্যাঁ, সম্ভব। পৃথিবীর যেমন ম্যাপ আছে, তেমনি আছে আকাশেরও ম্যাপ। এ তথ্যপ্রযুক্তির যুগে সেটা এখন চলে এসেছে স্মার্টফোনে। Sky Map নামের অ্যান্ড্রয়েড ফোন অথবা আইফোনে অ্যাপটি দিয়ে আপনি খুঁজে নিতে পারেন আকাশের সব তারা, আর গ্রহকে। প্রথমে গুগল প্লে–স্টোর বা অ্যাপলের অ্যাপস্টোর থেকে ডাউনলোড করে নিতে হবে অ্যাপটি। এটি চালু করলেই দেখা যাবে গ্রহ-নক্ষত্রের একটি ম্যাপ। অন্যান্য যেকোনো ম্যাপের চেয়ে এটি ব্যবহার করা অনেক বেশি সোজা। কারণ, এটিকে চালু করে আপনার ফোনটিকে আকাশের যেদিকে তাক করবেন, সেদিকের গ্রহ-নক্ষত্রগুলোকেই দেখা যাবে।\r\n\r\nআকাশের নানা অঞ্চলের কয়েকটি করে উজ্জ্বল তারা নিয়ে কল্পনা করা হতো সিংহ, ভালুক, মাছের মতো নানা আকৃতি। এই একেকটি অঞ্চলকে বলা হয় মণ্ডলী। স্কাই ম্যাপে প্রতিটি মণ্ডলীকে প্রচলিত আকৃতিতে মিলিয়েও দেখানো হয়েছে। আর আছে সব গ্রহ। খালি চোখে বুধ, শুক্র, মঙ্গল, বৃহস্পতি ও শনি গ্রহকে দেখা যায়। ম্যাপটি ব্যবহার করে আপনি খুব সহজেই খুঁজে পেতে পারবেন গ্রহগুলোকে। আকাশ চেনার ব্যাপারটি সবার কাছে দুর্বোধ্য লাগলেও এই ম্যাপটির ব্যবহার সেটিকে পানির মতো সহজ করে দেবে। আর আপনার সামনে উন্মুক্ত করবে বিশাল একটি জগত্।\r\n\r\nফোনভেদে অ্যাপসটির সাইজ হবে ২-৫ মেগাবাইট। বাজারে প্রচলিত সব অ্যান্ড্রয়েড কিংবা আইফোনেই সাপোর্ট করবে। তবে সব ফিচার পুরোপুরি ব্যবহার করতে প্রয়োজন পড়বে কম্পাস সেন্সরের। অ্যাপসটি ডাউনলোড করে প্রথমেই সেটিংসে গিয়ে Set location manually অপশন ক্লিক করে আপনার অবস্থান অনুযায়ী Latitude এবং Longitude সেট করুন। ঠিক অবস্থান জানা না থাকলে Latitude ২৩ ডিগ্রি উত্তর এবং Longitude ৯০ ডিগ্রি পূর্ব ব্যবহার করতে পারেন। অ্যাপসটি ব্যবহার করতে ইন্টারনেট কানেকশনের প্রয়োজন নেই। তবে লোকেশন ঠিক করার ঝামেলা এড়ানো যাবে শুধু জিপিএস কানেকশন অন রেখে।', 'ওমর ফারুক', 'Technology', '1618407011prothomalo_import_media_2019_10_03_17da1d1402bc55f9fd74a09c36754738-5d95b4029a925.png', '2021-04-14 19:30:11.288612', 0, 'Yes');

-- --------------------------------------------------------

--
-- Table structure for table `news_comment`
--

CREATE TABLE `news_comment` (
  `n_cid` int(100) NOT NULL,
  `news_id` varchar(100) NOT NULL,
  `news_comment` varchar(500) NOT NULL,
  `user_id` int(100) NOT NULL,
  `username` varchar(50) NOT NULL,
  `comment_time` datetime(6) NOT NULL DEFAULT current_timestamp(6)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `news_comment`
--

INSERT INTO `news_comment` (`n_cid`, `news_id`, `news_comment`, `user_id`, `username`, `comment_time`) VALUES
(1, '0', 'Hello', 11, 'himel', '2021-03-07 21:32:54.733610'),
(2, '0', 'null', 11, 'himel', '2021-03-07 21:34:28.759680'),
(3, '0', 'null pdoofo', 11, 'himel', '2021-03-07 21:37:49.803145'),
(4, '0', 'jjjjkk', 11, 'himel', '2021-03-07 21:39:22.455277'),
(5, '0', 'jjjjjjjjjjjjjjjjjjjj', 11, 'himel', '2021-03-07 21:41:42.341359'),
(6, '0', 'jjjjjjjjjjjjjjjjjjjjuuuuuuuuuuuu', 11, 'himel', '2021-03-07 21:44:20.072067'),
(7, '0', '', 11, 'himel', '2021-03-07 22:06:33.240091'),
(8, '<? echo $id= $_GET[\'id\']  ;?> ', 'ghhhhhhhhhhh', 11, 'himel', '2021-03-07 22:08:21.002910'),
(9, '', 'ghhhhhhhhhhh', 11, 'himel', '2021-03-07 22:09:15.753951'),
(10, '', 'ghhhhhhhhhhh', 11, 'himel', '2021-03-07 22:10:00.571304'),
(11, '', 'gg', 11, 'himel', '2021-03-07 22:14:04.934564'),
(12, '', 'gg', 11, 'himel', '2021-03-07 22:24:19.142186'),
(13, '', '', 11, 'himel', '2021-03-07 22:25:10.293217'),
(14, '', '', 11, 'himel', '2021-03-07 22:27:00.761789'),
(15, '', 'hhhhhhhh', 11, 'himel', '2021-03-07 22:32:12.434094'),
(16, '', '', 11, 'himel', '2021-03-07 22:35:06.567931'),
(17, '', '', 11, 'himel', '2021-03-07 22:36:31.188118'),
(18, '', '', 11, 'himel', '2021-03-07 22:36:55.846970'),
(19, '', '', 11, 'himel', '2021-03-07 22:43:05.709808'),
(20, '', '', 11, 'himel', '2021-03-07 22:52:13.673879'),
(21, '', '', 11, 'himel', '2021-03-07 22:57:02.865464');

-- --------------------------------------------------------

--
-- Table structure for table `user_activity`
--

CREATE TABLE `user_activity` (
  `aid` int(11) NOT NULL,
  `title` varchar(64) NOT NULL,
  `pageurl` varchar(128) NOT NULL,
  `number_times` int(11) NOT NULL,
  `active_time` int(11) NOT NULL,
  `id` int(11) NOT NULL,
  `start_time` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `user_activity`
--

INSERT INTO `user_activity` (`aid`, `title`, `pageurl`, `number_times`, `active_time`, `id`, `start_time`) VALUES
(1147, 'eSRD News', 'http://localhost/eSRDNews/index.php', 0, 0, 716, '2021-03-06 15:00:36'),
(1148, 'Log In', 'http://localhost/eSRDNews/index.php/login', 0, 0, 716, '2021-03-06 15:01:35'),
(1149, 'Md. Hafizur Rahman', 'http://localhost/eSRDNews/index.php/profile', 3, 0, 717, '2021-03-06 15:01:46'),
(1150, 'My Activity', 'http://localhost/eSRDNews/index.php/activity', 1, 0, 717, '2021-03-06 15:03:27'),
(1151, 'Test Page', 'http://localhost/eSRDNews/index.php/test', 0, 0, 717, '2021-03-06 15:05:30'),
(1152, 'Md. Hafizur Rahman', 'http://localhost/eSRDNews/index.php/profile', 2, 0, 718, '2021-03-06 15:07:36'),
(1153, 'Test Page', 'http://localhost/eSRDNews/index.php/test', 0, 0, 718, '2021-03-06 15:09:46'),
(1154, 'eSRD News', 'http://localhost/eSRDNews/index.php', 0, 0, 718, '2021-03-06 15:10:36'),
(1155, 'Md. Hafizur Rahman', 'http://localhost/eSRDNews/index.php/profile', 1, 0, 722, '2021-03-06 15:13:26'),
(1156, 'My Activity', 'http://localhost/eSRDNews/index.php/activity', 0, 0, 722, '2021-03-06 15:16:05'),
(1157, 'Md. Hafizur Rahman', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 723, '2021-03-06 15:19:08'),
(1158, 'Md. Hafizur Rahman', 'http://localhost/eSRDNews/index.php/profile', 1, 0, 724, '2021-03-06 15:25:19'),
(1159, 'Test Page', 'http://localhost/eSRDNews/index.php/test', 0, 0, 724, '2021-03-06 15:25:58'),
(1160, 'Md. Hafizur Rahman', 'http://localhost/eSRDNews/index.php/profile', 1, 0, 725, '2021-03-06 15:31:46'),
(1161, 'Test Page', 'http://localhost/eSRDNews/index.php/test', 0, 0, 725, '2021-03-06 15:36:21'),
(1162, 'Md. Hafizur Rahman', 'http://localhost/eSRDNews/index.php/profile', 1, 0, 726, '2021-03-06 15:39:06'),
(1163, 'My Activity', 'http://localhost/eSRDNews/index.php/activity', 0, 0, 726, '2021-03-06 15:42:25'),
(1164, 'Md. Hafizur Rahman', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 727, '2021-03-06 15:44:20'),
(1165, 'Md. Hafizur Rahman', 'http://localhost/eSRDNews/index.php/profile', 1, 0, 728, '2021-03-06 15:50:19'),
(1166, 'Message', 'http://localhost/eSRDNews/index.php/message', 1, 0, 728, '2021-03-06 15:50:25'),
(1167, 'Message', 'http://localhost/eSRDNews/index.php/message', 2, 0, 729, '2021-03-06 15:56:05'),
(1168, 'eSRD News', 'http://localhost/eSRDNews/index.php/welcome', 1, 0, 729, '2021-03-06 15:58:14'),
(1169, 'Md. Hafizur Rahman', 'http://localhost/eSRDNews/index.php/profile', 1, 0, 729, '2021-03-06 15:58:24'),
(1170, 'Message', 'http://localhost/eSRDNews/index.php/message', 1, 0, 730, '2021-03-06 16:02:29'),
(1171, 'Md. Hafizur Rahman', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 730, '2021-03-06 16:02:52'),
(1172, 'Md. Hafizur Rahman', 'http://localhost/eSRDNews/index.php/profile', 1, 0, 731, '2021-03-06 16:26:21'),
(1173, 'Message', 'http://localhost/eSRDNews/index.php/message', 1, 0, 731, '2021-03-06 16:26:27'),
(1174, 'Message', 'http://localhost/eSRDNews/index.php/message', 1, 0, 732, '2021-03-06 16:29:16'),
(1175, 'Md. Hafizur Rahman', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 732, '2021-03-06 16:29:22'),
(1176, 'Md. Hafizur Rahman', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 733, '2021-03-06 16:35:17'),
(1177, 'Message', 'http://localhost/eSRDNews/index.php/message', 0, 0, 733, '2021-03-06 16:35:22'),
(1178, 'Message', 'http://localhost/eSRDNews/index.php/message', 1, 0, 734, '2021-03-06 16:44:17'),
(1179, 'Md. Hafizur Rahman', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 734, '2021-03-06 16:44:33'),
(1180, 'Message', 'http://localhost/eSRDNews/index.php/message', 2, 0, 735, '2021-03-06 16:52:09'),
(1181, 'Md. Hafizur Rahman', 'http://localhost/eSRDNews/index.php/profile', 1, 0, 735, '2021-03-06 16:52:22'),
(1182, 'Message', 'http://localhost/eSRDNews/index.php/message', 0, 0, 736, '2021-03-06 16:57:21'),
(1183, 'Message', 'http://localhost/eSRDNews/index.php/message', 1, 0, 737, '2021-03-06 17:07:02'),
(1184, 'Md. Hafizur Rahman', 'http://localhost/eSRDNews/index.php/profile', 2, 0, 737, '2021-03-06 17:08:02'),
(1185, 'My Activity', 'http://localhost/eSRDNews/index.php/activity', 0, 0, 737, '2021-03-06 17:08:44'),
(1186, 'Md. Hafizur Rahman', 'http://localhost/eSRDNews/index.php/profile', 3, 0, 738, '2021-03-06 17:13:28'),
(1187, 'Message', 'http://localhost/eSRDNews/index.php/message', 2, 0, 738, '2021-03-06 17:13:33'),
(1188, 'Md. Hafizur Rahman', 'http://localhost/eSRDNews/index.php/profile', 1, 0, 739, '2021-03-06 17:28:21'),
(1189, 'eSRD News', 'http://localhost/eSRDNews/index.php', 0, 0, 739, '2021-03-06 17:28:46'),
(1190, 'Md. Hafizur Rahman', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 740, '2021-03-06 17:34:20'),
(1191, 'Md. Hafizur Rahman', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 741, '2021-03-06 17:39:34'),
(1192, 'Md. Hafizur Rahman', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 742, '2021-03-06 17:44:42'),
(1193, 'Md. Hafizur Rahman', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 743, '2021-03-06 17:50:13'),
(1194, 'Md. Hafizur Rahman', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 744, '2021-03-06 17:55:37'),
(1195, 'Md. Hafizur Rahman', 'http://localhost/eSRDNews/index.php/profile', 2, 0, 745, '2021-03-06 18:03:25'),
(1196, 'Message', 'http://localhost/eSRDNews/index.php/message', 1, 0, 745, '2021-03-06 18:05:15'),
(1197, 'eSRD News', 'http://localhost/eSRDNews/index.php', 0, 0, 746, '2021-03-07 05:57:42'),
(1198, 'Log In', 'http://localhost/eSRDNews/index.php/login', 0, 0, 746, '2021-03-07 05:58:00'),
(1199, 'Md. Hafizur Rahman', 'http://localhost/eSRDNews/index.php/profile', 3, 0, 747, '2021-03-07 05:58:30'),
(1200, 'My Activity', 'http://localhost/eSRDNews/index.php/activity', 0, 0, 747, '2021-03-07 06:00:51'),
(1201, 'Message', 'http://localhost/eSRDNews/index.php/message', 1, 0, 747, '2021-03-07 06:02:22'),
(1202, 'My Activity', 'http://localhost/eSRDNews/index.php/activity', 1, 0, 748, '2021-03-07 06:03:58'),
(1203, 'Md. Hafizur Rahman', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 748, '2021-03-07 06:04:03'),
(1204, 'My Activity', 'http://localhost/eSRDNews/index.php/activity', 0, 0, 749, '2021-03-07 06:09:42'),
(1205, 'My Activity', 'http://localhost/eSRDNews/index.php/activity', 0, 0, 750, '2021-03-07 06:15:57'),
(1206, 'Md. Hafizur Rahman', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 750, '2021-03-07 06:16:08'),
(1207, 'Message', 'http://localhost/eSRDNews/index.php/message', 0, 0, 750, '2021-03-07 06:16:14'),
(1208, 'Message', 'http://localhost/eSRDNews/index.php/message', 0, 0, 751, '2021-03-07 06:24:21'),
(1209, 'Message', 'http://localhost/eSRDNews/index.php/message', 1, 0, 752, '2021-03-07 06:30:34'),
(1210, 'Md. Hafizur Rahman', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 752, '2021-03-07 06:33:49'),
(1211, 'Message', 'http://localhost/eSRDNews/index.php/message', 2, 0, 753, '2021-03-07 06:36:59'),
(1212, 'Md. Hafizur Rahman', 'http://localhost/eSRDNews/index.php/profile', 3, 0, 753, '2021-03-07 06:37:08'),
(1213, 'My Activity', 'http://localhost/eSRDNews/index.php/activity', 1, 0, 753, '2021-03-07 06:37:32'),
(1214, 'Message', 'http://localhost/eSRDNews/index.php/message', 0, 0, 754, '2021-03-07 06:42:04'),
(1215, 'Message', 'http://localhost/eSRDNews/index.php/message', 0, 0, 755, '2021-03-07 06:56:59'),
(1216, 'Message', 'http://localhost/eSRDNews/index.php/message', 0, 0, 756, '2021-03-07 07:02:15'),
(1217, 'Message', 'http://localhost/eSRDNews/index.php/message', 0, 0, 757, '2021-03-07 07:08:53'),
(1218, 'Message', 'http://localhost/eSRDNews/index.php/message', 0, 0, 758, '2021-03-07 07:18:02'),
(1219, 'Message', 'http://localhost/eSRDNews/index.php/message', 0, 0, 759, '2021-03-07 07:23:20'),
(1220, 'Message', 'http://localhost/eSRDNews/index.php/message', 0, 0, 760, '2021-03-07 07:29:03'),
(1221, 'Message', 'http://localhost/eSRDNews/index.php/message', 0, 0, 761, '2021-03-07 07:34:17'),
(1222, 'Message', 'http://localhost/eSRDNews/index.php/message', 0, 0, 762, '2021-03-07 07:40:43'),
(1223, 'Message', 'http://localhost/eSRDNews/index.php/message', 0, 0, 763, '2021-03-07 07:46:00'),
(1224, 'Message', 'http://localhost/eSRDNews/index.php/message', 4, 0, 764, '2021-03-07 07:52:26'),
(1225, 'Md. Hafizur Rahman', 'http://localhost/eSRDNews/index.php/profile', 4, 0, 764, '2021-03-07 07:54:52'),
(1226, 'My Activity', 'http://localhost/eSRDNews/index.php/activity', 0, 0, 764, '2021-03-07 07:56:04'),
(1227, 'Md. Hafizur Rahman', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 765, '2021-03-07 07:57:29'),
(1228, 'Md. Hafizur Rahman', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 766, '2021-03-07 08:15:07'),
(1229, 'Md. Hafizur Rahman', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 767, '2021-03-07 08:47:54'),
(1230, 'Log In', 'http://localhost/eSRDNews/index.php/login', 0, 0, 767, '2021-03-07 08:48:22'),
(1231, 'Md. Hafizur Rahman', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 768, '2021-03-07 08:50:04'),
(1232, 'Log In', 'http://localhost/eSRDNews/index.php/login', 0, 0, 768, '2021-03-07 08:52:26'),
(1233, 'HSC PHYSICS', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 769, '2021-03-07 08:53:36'),
(1234, 'Log In', 'http://localhost/eSRDNews/index.php/login', 0, 0, 769, '2021-03-07 08:54:00'),
(1235, 'Md. Hafizur Rahman', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 770, '2021-03-07 08:55:25'),
(1236, 'Log In', 'http://localhost/eSRDNews/index.php/login', 0, 0, 770, '2021-03-07 08:55:47'),
(1237, 'Himel HR', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 771, '2021-03-07 08:56:32'),
(1238, 'Log In', 'http://localhost/eSRDNews/index.php/login', 0, 0, 771, '2021-03-07 08:56:50'),
(1239, 'Md. Hafizur Rahman', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 772, '2021-03-07 08:57:14'),
(1240, 'Md. Hafizur Rahman', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 773, '2021-03-07 09:02:16'),
(1241, 'Md. Hafizur Rahman', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 774, '2021-03-07 09:07:21'),
(1242, 'Log In', 'http://localhost/eSRDNews/index.php/login', 0, 0, 774, '2021-03-07 09:08:25'),
(1243, 'Md. Hafizur', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 775, '2021-03-07 09:08:48'),
(1244, 'Log In', 'http://localhost/eSRDNews/index.php/login', 0, 0, 775, '2021-03-07 09:10:58'),
(1245, 'Hafizur Rahman Himel', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 776, '2021-03-07 09:11:22'),
(1246, 'Hafizur Rahman Himel', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 777, '2021-03-07 09:51:29'),
(1247, 'Log In', 'http://localhost/eSRDNews/index.php/login', 0, 0, 777, '2021-03-07 09:51:45'),
(1248, 'Hafizur Rahman Himel', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 778, '2021-03-07 09:52:08'),
(1249, 'Log In', 'http://localhost/eSRDNews/index.php/login', 0, 0, 778, '2021-03-07 09:54:22'),
(1250, 'Hafizur Rahman Himel', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 779, '2021-03-07 09:54:32'),
(1251, 'Log In', 'http://localhost/eSRDNews/index.php/login', 0, 0, 779, '2021-03-07 09:54:39'),
(1252, 'Hafizur Rahman Himel', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 780, '2021-03-07 09:55:04'),
(1253, 'Hafizur Rahman Himel', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 781, '2021-03-07 10:04:19'),
(1254, 'Hafizur Rahman Himel', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 782, '2021-03-07 10:10:13'),
(1255, 'Hafizur Rahman Himel', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 783, '2021-03-07 10:15:30'),
(1256, 'eSRD News', 'http://localhost/eSRDNews/index.php', 0, 0, 783, '2021-03-07 10:19:09'),
(1257, 'Log In', 'http://localhost/eSRDNews/index.php/login', 0, 0, 784, '2021-03-07 10:19:19'),
(1258, 'eSRD News', 'http://localhost/eSRDNews/index.php', 0, 0, 785, '2021-03-07 12:26:37'),
(1259, 'Log In', 'http://localhost/eSRDNews/index.php/login', 0, 0, 785, '2021-03-07 12:26:48'),
(1260, 'Hafizur Rahman Himel', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 786, '2021-03-07 12:27:01'),
(1261, 'Hafizur Rahman Himel', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 787, '2021-03-07 12:33:36'),
(1262, 'Hafizur Rahman Himel', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 788, '2021-03-07 12:38:40'),
(1263, 'Hafizur Rahman Himel', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 789, '2021-03-07 12:44:36'),
(1264, 'Hafizur Rahman Himel', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 790, '2021-03-07 12:50:22'),
(1265, 'Hafizur Rahman Himel', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 791, '2021-03-07 12:59:13'),
(1266, 'Hafizur Rahman Himel', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 792, '2021-03-07 13:23:47'),
(1267, 'Log In', 'http://localhost/eSRDNews/index.php/login', 0, 0, 793, '2021-03-07 13:39:34'),
(1268, 'Log In', 'http://localhost/eSRDNews/index.php/login', 1, 0, 794, '2021-03-07 13:48:45'),
(1269, 'Hafizur Rahman Himel', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 794, '2021-03-07 13:48:50'),
(1270, 'Hafizur Rahman Himel', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 795, '2021-03-07 13:51:15'),
(1271, 'Log In', 'http://localhost/eSRDNews/index.php/login', 0, 0, 795, '2021-03-07 13:52:18'),
(1272, 'Hafizur Rahman Himel', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 796, '2021-03-07 13:57:46'),
(1273, 'Log In', 'http://localhost/eSRDNews/index.php/login', 0, 0, 796, '2021-03-07 13:58:09'),
(1274, 'Hafizur Rahman Himel', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 797, '2021-03-07 14:01:21'),
(1275, 'Log In', 'http://localhost/eSRDNews/index.php/login', 2, 0, 797, '2021-03-07 14:01:45'),
(1276, 'Registration', 'http://localhost/eSRDNews/index.php/register', 1, 0, 797, '2021-03-07 14:02:06'),
(1277, 'Md. Hafizur Rahman', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 798, '2021-03-07 14:04:47'),
(1278, 'Log In', 'http://localhost/eSRDNews/index.php/login', 0, 0, 798, '2021-03-07 14:05:09'),
(1279, 'Md. Hafizur', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 799, '2021-03-07 14:12:08'),
(1280, 'eSRD News', 'http://localhost/eSRDNews/index.php', 0, 0, 814, '2021-03-07 14:14:19'),
(1281, 'Md. Hafizur', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 814, '2021-03-07 14:14:24'),
(1282, 'Log In', 'http://localhost/eSRDNews/index.php/login', 0, 0, 815, '2021-03-07 14:15:37'),
(1283, 'Md. Hafizur Rahman', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 816, '2021-03-07 14:15:43'),
(1284, 'Md. Hafizur Rahman', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 817, '2021-03-07 14:22:06'),
(1285, 'Md. Hafizur Rahman', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 820, '2021-03-07 14:27:09'),
(1286, 'Log In', 'http://localhost/eSRDNews/index.php/login', 0, 0, 821, '2021-03-07 14:27:17'),
(1287, 'Md. Hafizur', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 822, '2021-03-07 14:27:23'),
(1288, 'Log In', 'http://localhost/eSRDNews/index.php/login', 0, 0, 822, '2021-03-07 14:27:40'),
(1289, 'Log In', 'http://localhost/eSRDNews/index.php/login', 1, 0, 823, '2021-03-07 14:39:28'),
(1290, 'International', 'http://localhost/eSRDNews/index.php/categorynews', 0, 0, 823, '2021-03-07 14:42:48'),
(1291, 'News Details', 'http://localhost/eSRDNews/index.php/newsdetails', 0, 0, 823, '2021-03-07 14:42:51'),
(1292, 'Hafizur', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 824, '2021-03-07 14:43:27'),
(1293, 'International', 'http://localhost/eSRDNews/index.php/categorynews', 0, 0, 824, '2021-03-07 14:43:36'),
(1294, 'News Details', 'http://localhost/eSRDNews/index.php/newsdetails', 0, 0, 824, '2021-03-07 14:43:39'),
(1295, 'News Details', 'http://localhost/eSRDNews/index.php/newsdetails', 1, 0, 825, '2021-03-07 14:53:53'),
(1296, 'Hafizur', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 825, '2021-03-07 14:58:44'),
(1297, 'Log In', 'http://localhost/eSRDNews/index.php/login', 1, 0, 826, '2021-03-07 14:58:53'),
(1298, 'eSRD News', 'http://localhost/eSRDNews/index.php', 0, 0, 826, '2021-03-07 14:58:57'),
(1299, 'News Details', 'http://localhost/eSRDNews/index.php/newsdetails', 0, 0, 826, '2021-03-07 14:59:02'),
(1300, 'Hafizur', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 827, '2021-03-07 14:59:15'),
(1301, 'eSRD News', 'http://localhost/eSRDNews/index.php', 0, 0, 827, '2021-03-07 14:59:18'),
(1302, 'News Details', 'http://localhost/eSRDNews/index.php/newsdetails', 0, 0, 827, '2021-03-07 14:59:21'),
(1303, 'News Details', 'http://localhost/eSRDNews/index.php/newsdetails', 0, 0, 828, '2021-03-07 15:06:47'),
(1304, 'News Details', 'http://localhost/eSRDNews/index.php/newsdetails', 0, 0, 829, '2021-03-07 15:22:27'),
(1305, 'News Details', 'http://localhost/eSRDNews/index.php/newsdetails', 2, 0, 830, '2021-03-07 15:32:31'),
(1306, 'eSRD News', 'http://localhost/eSRDNews/index.php/welcome', 1, 0, 830, '2021-03-07 15:32:55'),
(1307, 'eSRD News', 'http://localhost/eSRDNews/index.php/welcome', 2, 0, 831, '2021-03-07 15:37:51'),
(1308, 'News Details', 'http://localhost/eSRDNews/index.php/newsdetails', 1, 0, 831, '2021-03-07 15:39:16'),
(1309, 'News Details', 'http://localhost/eSRDNews/index.php/newsdetails', 1, 0, 832, '2021-03-07 15:43:19'),
(1310, 'eSRD News', 'http://localhost/eSRDNews/index.php/welcome', 0, 0, 832, '2021-03-07 15:44:21'),
(1311, 'eSRD News', 'http://localhost/eSRDNews/index.php/welcome', 3, 0, 833, '2021-03-07 16:06:34'),
(1312, 'News Details', 'http://localhost/eSRDNews/index.php/newsdetails', 4, 0, 833, '2021-03-07 16:06:44'),
(1313, 'Hafizur', 'http://localhost/eSRDNews/index.php/profile', 1, 0, 833, '2021-03-07 16:07:07'),
(1314, 'Message', 'http://localhost/eSRDNews/index.php/message', 0, 0, 833, '2021-03-07 16:07:12'),
(1315, 'News Details', 'http://localhost/eSRDNews/index.php/newsdetails', 1, 0, 834, '2021-03-07 16:11:42'),
(1316, 'eSRD News', 'http://localhost/eSRDNews/index.php/welcome', 0, 0, 834, '2021-03-07 16:14:06'),
(1317, 'eSRD News', 'http://localhost/eSRDNews/index.php/welcome', 2, 0, 835, '2021-03-07 16:24:20'),
(1318, 'News Details', 'http://localhost/eSRDNews/index.php/newsdetails', 2, 0, 835, '2021-03-07 16:24:31'),
(1319, 'News Details', 'http://localhost/eSRDNews/index.php/newsdetails', 1, 0, 836, '2021-03-07 16:28:37'),
(1320, 'eSRD News', 'http://localhost/eSRDNews/index.php/welcome', 0, 0, 836, '2021-03-07 16:32:13'),
(1321, 'News Details', 'http://localhost/eSRDNews/index.php/newsdetails', 3, 0, 837, '2021-03-07 16:35:00'),
(1322, 'eSRD News', 'http://localhost/eSRDNews/index.php/welcome', 2, 0, 837, '2021-03-07 16:35:07'),
(1323, 'eSRD News', 'http://localhost/eSRDNews/index.php/welcome', 0, 0, 838, '2021-03-07 16:43:06'),
(1324, 'News Details', 'http://localhost/eSRDNews/index.php/newsdetails', 0, 0, 838, '2021-03-07 16:43:17'),
(1325, 'News Details', 'http://localhost/eSRDNews/index.php/newsdetails', 1, 0, 839, '2021-03-07 16:49:18'),
(1326, 'eSRD News', 'http://localhost/eSRDNews/index.php/welcome', 0, 0, 839, '2021-03-07 16:52:14'),
(1327, 'eSRD News', 'http://localhost/eSRDNews/index.php/welcome', 0, 0, 840, '2021-03-07 16:57:04'),
(1328, 'eSRD News', 'http://localhost/eSRDNews/index.php', 0, 0, 841, '2021-03-30 15:10:35'),
(1329, 'Log In', 'http://localhost/eSRDNews/index.php/login', 0, 0, 841, '2021-03-30 15:11:21'),
(1330, 'Hafizur', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 842, '2021-03-30 15:14:21'),
(1331, 'eSRD News', 'http://localhost/eSRDNews/index.php', 0, 0, 843, '2021-04-02 09:42:58'),
(1332, 'eSRD News', 'http://localhost/eSRDNews/index.php', 0, 0, 844, '2021-04-02 09:46:14'),
(1333, 'eSRD News', 'http://localhost/eSRDNews/index.php', 0, 0, 845, '2021-04-12 16:47:28'),
(1334, 'eSRD News', 'http://localhost/eSRDNews/index.php', 0, 0, 846, '2021-04-13 05:56:18'),
(1335, 'eSRD News', 'http://localhost/eSRDNews/index.php', 0, 0, 847, '2021-04-14 11:26:31'),
(1336, 'Log In', 'http://localhost/eSRDNews/index.php/login', 0, 0, 847, '2021-04-14 11:26:48'),
(1337, 'Admin Log In', 'http://localhost/eSRDNews/index.php/adminlogin', 0, 0, 847, '2021-04-14 11:29:57'),
(1338, 'Admin Profile', 'http://localhost/eSRDNews/index.php/adminprofile', 1, 0, 848, '2021-04-14 11:30:09'),
(1339, 'User Info List', 'http://localhost/eSRDNews/index.php/adminuserinfo', 1, 0, 848, '2021-04-14 11:31:00'),
(1340, '', 'http://localhost/eSRDNews/index.php/profile', 0, 0, 848, '2021-04-14 11:31:23'),
(1341, 'Create New News Post', 'http://localhost/eSRDNews/index.php/admincreatenews', 0, 0, 848, '2021-04-14 11:31:46'),
(1342, 'Admin Log In', 'http://localhost/eSRDNews/index.php/adminlogin', 0, 0, 848, '2021-04-14 11:32:38'),
(1343, 'Bangladesh', 'http://localhost/eSRDNews/index.php/categorynews', 1, 0, 848, '2021-04-14 11:32:58'),
(1344, 'eSRD News', 'http://localhost/eSRDNews/index.php', 0, 0, 848, '2021-04-14 11:33:06'),
(1345, 'Log In', 'http://localhost/eSRDNews/index.php/login', 0, 0, 849, '2021-04-14 11:41:21'),
(1346, 'Admin Log In', 'http://localhost/eSRDNews/index.php/adminlogin', 0, 0, 849, '2021-04-14 11:41:42'),
(1347, 'Admin Profile', 'http://localhost/eSRDNews/index.php/adminprofile', 0, 0, 850, '2021-04-14 11:42:03'),
(1348, 'Create New News Post', 'http://localhost/eSRDNews/index.php/admincreatenews', 0, 0, 850, '2021-04-14 11:42:09'),
(1349, 'Admin Log In', 'http://localhost/eSRDNews/index.php/adminlogin', 0, 0, 850, '2021-04-14 11:43:13'),
(1350, 'Bangladesh', 'http://localhost/eSRDNews/index.php/categorynews', 1, 0, 850, '2021-04-14 11:43:52'),
(1351, 'eSRD News', 'http://localhost/eSRDNews/index.php', 0, 0, 850, '2021-04-14 11:44:03'),
(1352, 'eSRD News', 'http://localhost/eSRDNews/index.php', 6, 0, 851, '2021-04-14 11:48:13'),
(1353, 'News Details', 'http://localhost/eSRDNews/index.php/newsdetails', 5, 0, 851, '2021-04-14 11:48:31'),
(1354, 'eSRD News', 'http://localhost/eSRDNews/index.php', 1, 0, 852, '2021-04-14 11:53:23'),
(1355, 'News Details', 'http://localhost/eSRDNews/index.php/newsdetails', 0, 0, 852, '2021-04-14 11:57:11'),
(1356, 'eSRD News', 'http://localhost/eSRDNews/index.php', 1, 0, 853, '2021-04-14 11:59:05'),
(1357, 'News Details', 'http://localhost/eSRDNews/index.php/newsdetails', 0, 0, 853, '2021-04-14 12:03:54'),
(1358, 'eSRD News', 'http://localhost/eSRDNews/index.php', 0, 0, 854, '2021-04-14 12:05:03'),
(1359, 'Sports', 'http://localhost/eSRDNews/index.php/categorynews', 0, 0, 854, '2021-04-14 12:08:33'),
(1360, 'News Details', 'http://localhost/eSRDNews/index.php/newsdetails', 0, 0, 854, '2021-04-14 12:08:37'),
(1361, 'News Details', 'http://localhost/eSRDNews/index.php/newsdetails', 5, 0, 855, '2021-04-14 12:10:13'),
(1362, 'Sports', 'http://localhost/eSRDNews/index.php/categorynews', 5, 0, 855, '2021-04-14 12:13:22'),
(1363, 'eSRD News', 'http://localhost/eSRDNews/index.php', 0, 0, 855, '2021-04-14 12:13:24'),
(1364, 'News Details', 'http://localhost/eSRDNews/index.php/newsdetails', 0, 0, 856, '2021-04-14 12:15:20'),
(1365, 'eSRD News', 'http://localhost/eSRDNews/index.php', 0, 0, 856, '2021-04-14 12:16:25'),
(1366, 'Log In', 'http://localhost/eSRDNews/index.php/login', 0, 0, 856, '2021-04-14 12:18:41'),
(1367, 'Admin Log In', 'http://localhost/eSRDNews/index.php/adminlogin', 0, 0, 856, '2021-04-14 12:19:22'),
(1368, 'Admin Profile', 'http://localhost/eSRDNews/index.php/adminprofile', 0, 0, 857, '2021-04-14 12:19:40'),
(1369, 'Create New News Post', 'http://localhost/eSRDNews/index.php/admincreatenews', 0, 0, 857, '2021-04-14 12:19:54'),
(1370, 'eSRD News', 'http://localhost/eSRDNews/index.php', 0, 0, 857, '2021-04-14 12:22:43'),
(1371, 'Create New News Post', 'http://localhost/eSRDNews/index.php/admincreatenews', 0, 0, 858, '2021-04-14 12:40:59'),
(1372, 'eSRD News', 'http://localhost/eSRDNews/index.php', 0, 0, 858, '2021-04-14 12:45:11'),
(1373, 'Create New News Post', 'http://localhost/eSRDNews/index.php/admincreatenews', 1, 0, 859, '2021-04-14 12:49:26'),
(1374, 'eSRD News', 'http://localhost/eSRDNews/index.php', 1, 0, 859, '2021-04-14 12:49:31'),
(1375, 'eSRD News', 'http://localhost/eSRDNews/index.php', 0, 0, 860, '2021-04-14 12:55:49'),
(1376, 'Create New News Post', 'http://localhost/eSRDNews/index.php/admincreatenews', 1, 0, 861, '2021-04-14 13:02:18'),
(1377, 'eSRD News', 'http://localhost/eSRDNews/index.php', 0, 0, 861, '2021-04-14 13:02:22'),
(1378, 'Create New News Post', 'http://localhost/eSRDNews/index.php/admincreatenews', 0, 0, 862, '2021-04-14 13:07:44'),
(1379, 'eSRD News', 'http://localhost/eSRDNews/index.php', 0, 0, 862, '2021-04-14 13:11:01'),
(1380, 'News Details', 'http://localhost/eSRDNews/index.php/newsdetails', 0, 0, 862, '2021-04-14 13:11:53'),
(1381, 'eSRD News', 'http://localhost/eSRDNews/index.php', 2, 0, 863, '2021-04-14 13:12:54'),
(1382, 'News Details', 'http://localhost/eSRDNews/index.php/newsdetails', 0, 0, 863, '2021-04-14 13:14:16'),
(1383, 'Create New News Post', 'http://localhost/eSRDNews/index.php/admincreatenews', 0, 0, 863, '2021-04-14 13:16:39'),
(1384, 'Create New News Post', 'http://localhost/eSRDNews/index.php/admincreatenews', 1, 0, 864, '2021-04-14 13:18:42'),
(1385, 'eSRD News', 'http://localhost/eSRDNews/index.php', 0, 0, 864, '2021-04-14 13:18:48'),
(1386, 'Create New News Post', 'http://localhost/eSRDNews/index.php/admincreatenews', 0, 0, 865, '2021-04-14 13:24:50'),
(1387, 'eSRD News', 'http://localhost/eSRDNews/index.php', 0, 0, 865, '2021-04-14 13:28:30'),
(1388, 'Create New News Post', 'http://localhost/eSRDNews/index.php/admincreatenews', 0, 0, 866, '2021-04-14 13:30:11'),
(1389, 'eSRD News', 'http://localhost/eSRDNews/index.php', 0, 0, 866, '2021-04-14 13:30:18'),
(1390, 'eSRD News', 'http://localhost/eSRDNews/index.php', 0, 0, 867, '2021-04-14 13:36:58'),
(1391, 'eSRD News', 'http://localhost/eSRDNews/index.php', 0, 0, 868, '2021-04-14 13:43:26'),
(1392, 'News Details', 'http://localhost/eSRDNews/index.php/newsdetails', 0, 0, 868, '2021-04-14 13:45:38'),
(1393, 'News Details', 'http://localhost/eSRDNews/index.php/newsdetails', 0, 0, 869, '2021-04-14 13:49:51'),
(1394, 'eSRD News', 'http://localhost/eSRDNews/index.php', 1, 0, 869, '2021-04-14 13:50:18'),
(1395, 'Contact Us', 'http://localhost/eSRDNews/index.php/contact', 1, 0, 869, '2021-04-14 13:50:55'),
(1396, 'About Us', 'http://localhost/eSRDNews/index.php/about', 1, 0, 869, '2021-04-14 13:51:06'),
(1397, 'International', 'http://localhost/eSRDNews/index.php/categorynews', 2, 0, 869, '2021-04-14 13:52:10');

-- --------------------------------------------------------

--
-- Table structure for table `user_infos`
--

CREATE TABLE `user_infos` (
  `user_id` int(100) NOT NULL,
  `name` varchar(50) NOT NULL,
  `uname` varchar(20) NOT NULL,
  `password` varchar(500) NOT NULL,
  `gender` varchar(10) DEFAULT NULL,
  `bdate` date NOT NULL,
  `phone` varchar(15) NOT NULL,
  `email` varchar(50) NOT NULL,
  `address` varchar(128) DEFAULT NULL,
  `udate` timestamp NOT NULL DEFAULT current_timestamp(),
  `u_status` varchar(10) NOT NULL DEFAULT 'Valid',
  `u_photo` varchar(100) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `user_infos`
--

INSERT INTO `user_infos` (`user_id`, `name`, `uname`, `password`, `gender`, `bdate`, `phone`, `email`, `address`, `udate`, `u_status`, `u_photo`) VALUES
(11, 'Hafizur', 'himel', '827ccb0eea8a706c4c34a16891f84e7b', 'Male', '2021-03-01', '01680735420', 'hhafizur@yahoo.com', '118 Middle Pirerbagh', '2021-03-07 14:03:31', 'Valid', NULL),
(12, 'Hafizur', 'sizan', 'e10adc3949ba59abbe56e057f20f883e', 'Male', '2021-03-02', '01680735420', 'sizan@gmail.com', 'Shyamoli', '2021-03-07 14:04:26', 'Valid', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `user_session`
--

CREATE TABLE `user_session` (
  `sid` int(11) NOT NULL,
  `session_id` varchar(32) NOT NULL,
  `user_id` varchar(32) DEFAULT NULL,
  `ipaddress` varchar(15) NOT NULL,
  `os` varchar(32) NOT NULL,
  `browser` varchar(32) NOT NULL,
  `version` varchar(30) NOT NULL,
  `udate` timestamp NOT NULL DEFAULT current_timestamp(),
  `s_end` timestamp(6) NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `user_session`
--

INSERT INTO `user_session` (`sid`, `session_id`, `user_id`, `ipaddress`, `os`, `browser`, `version`, `udate`, `s_end`) VALUES
(716, 'h0a6jcg79oee5p0qlji4n4rio9qjmkv1', NULL, '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-06 15:00:36', NULL),
(717, '267fcs3i22oavu8km0plrc0jtv7v01bq', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-06 15:01:46', NULL),
(718, 'rue81gpst2l64j7mn80jpntnfp5har5v', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-06 15:07:36', NULL),
(722, 'vjgctt3b83tf2t1o8co6ttnsmb9co7ac', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-06 15:13:26', NULL),
(723, 'elogcnmnt9dmmm70d29mtnln3jmdd74u', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-06 15:19:08', NULL),
(724, '9hs6dnj46eeq14m4uk0u6h756og8emj5', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-06 15:25:19', NULL),
(725, 'lssjhe4murqvfi842hlhcd9gvqjd28sv', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-06 15:31:46', NULL),
(726, 'nbfvr4kmi3sarkn5s4i7u0m2r7ed209a', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-06 15:39:06', NULL),
(727, 'oetop73okfrclucqu4lrb47rfa9ao1kk', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-06 15:44:20', NULL),
(728, 'e7prnfml100lkurrt4bjgmbe1ujrvuj9', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-06 15:50:19', NULL),
(729, 'a5j1iulsg24ara6mtompokg4u59vh007', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-06 15:56:05', NULL),
(730, '2ntv651tup76obcj65pbesumctgsdrms', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-06 16:02:29', NULL),
(731, 'g3r6vpclc08n1jes54v89brqpc4lqu7l', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-06 16:26:21', NULL),
(732, 'h6j5sp2tnit99cjta0gsl9r41iuqfnjn', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-06 16:29:16', NULL),
(733, 'g867g5l4oi8qd8d2np8mne85h14b6b48', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-06 16:35:17', NULL),
(734, 'glaoh8h707h80frq5g0i0lskbqfurl7m', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-06 16:44:17', NULL),
(735, 'chskire0jnsibf3qrs2koq27vgepsvn5', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-06 16:52:09', NULL),
(736, 'mdk608lqmfr48j6hbcb00tavcvta1fmv', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-06 16:57:21', NULL),
(737, 'ldnbri8t8sn4begfloujao44lkq5ruv7', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-06 17:07:02', NULL),
(738, '8upilgvlqojgru51t27g56eqhb54bcsa', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-06 17:13:28', NULL),
(739, '2n54g01hkfifrp3ppr3j8jd78mhif277', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-06 17:28:21', NULL),
(740, 't9it92ms28irt7q3u5r048a5bp20ifto', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-06 17:34:20', NULL),
(741, 'ubn73nmto6482bvcrsvsb7oqdu9c0gf0', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-06 17:39:34', NULL),
(742, 'jt2l76ukqv1qamp3qef9ksph59iddljv', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-06 17:44:42', NULL),
(743, '7ejgjrck6jiceu7ms0i78mijs1o6hnmk', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-06 17:50:13', NULL),
(744, 'e88e7703fgsps376duic43j25drffb9f', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-06 17:55:37', NULL),
(745, 'o36aim1qdusdi9mm9civi2rt98686rfm', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-06 18:03:25', NULL),
(746, 'e0e2u41i5mvp9erjfko8g08j2qcau1iv', NULL, '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 05:57:42', NULL),
(747, 'bfbl21bbpjodm25jj2pbhs6qj4blsno9', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 05:58:30', NULL),
(748, 'kjmlqugvm9ases158980c4jebo3bhi5a', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 06:03:58', NULL),
(749, 'ltrld0mbni04ab3ost2gp24iselq2mio', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 06:09:42', NULL),
(750, 'ge5o8ep7dafodpbrjt0mbjrmrdp1lo7n', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 06:15:57', NULL),
(751, 'ibvgmvhlsm5580b336dbrc85ptd7v7mi', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 06:24:21', NULL),
(752, '5567hr0g114ajsb4f241hnebjqoh5k3l', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 06:30:34', NULL),
(753, '2e4dl1o7fpvh4rbbl9ltc72beaj2medt', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 06:36:59', NULL),
(754, 'pa30iup56r6ioe675smg0egs30mo55qc', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 06:42:04', NULL),
(755, '6vb78d6f7q5t6poikh652ptlselrmn29', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 06:56:59', NULL),
(756, 'bnp159g9g124ijufgnmherfdqdv9b39b', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 07:02:15', NULL),
(757, 'd7fj3rrgiv14g31r25eeke8mtpl67k8i', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 07:08:53', NULL),
(758, 'v4a4v2p8mrmpgetorugcg3asd2qu6kie', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 07:18:02', NULL),
(759, 's269ciejks60db8cm307ka14rdtaj28l', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 07:23:20', NULL),
(760, 'vepg4geb1d1mejqrbf56jck3u0kfb7lo', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 07:29:03', NULL),
(761, 'm527gi43t2se9s9ioqa5uuslsdi60i3n', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 07:34:17', NULL),
(762, 'j7046cdmj1djiks3rl7jn7s6u6t0dfbb', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 07:40:43', NULL),
(763, '1scfb4njch5r76uem0env6ptiprldc3g', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 07:46:00', NULL),
(764, 'q44hdhnehqkgulefrfjaujqmhr01t89o', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 07:52:26', NULL),
(765, 'tl3ghe5bcjvl11h7btn47rjakch9qsns', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 07:57:29', NULL),
(766, 'rr9v5luuitom4rfq84e1djk6iubr5i0b', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 08:15:07', NULL),
(767, 'ered430sq0hc5f0shbdbrm5cjgus0bva', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 08:47:54', NULL),
(768, '5ffmhaimjh8nkpp8dql88q4i72cpg8bv', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 08:50:04', NULL),
(769, 'ck5hegrk9miknv6ijfoqr1upuhvfiegu', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 08:53:36', NULL),
(770, '09pspk85e19f7qsjalsjs8o2qehb7s3u', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 08:55:25', NULL),
(771, '87kaqreds6rdcm1p16or3ulv9o8jc8ov', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 08:56:32', NULL),
(772, '7n93uj2i3er752qdtbsebqiuh8hq6f4o', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 08:57:14', NULL),
(773, 'tt0dksehp6sq12u2r3db4v1nce7ql5u5', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 09:02:16', NULL),
(774, '3416i957chps46tohj56dgsjp4kq6ci4', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 09:07:21', NULL),
(775, '9u489r5bob0lt789rfn8cdp46bno5enb', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 09:08:48', NULL),
(776, '5dimogmplvnq7fikehu8c8sg9mb8a96t', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 09:11:22', NULL),
(777, 'mplm1r40ne3c9j8laiagm7diqc4u0ru8', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 09:51:29', NULL),
(778, 'jm9qomnq9spkgktova7ldbh3epbt7m1v', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 09:52:08', NULL),
(779, 'hhgftt63rpkf260mi2q6qoaptimqotcl', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 09:54:32', NULL),
(780, 'f8prm32nf8j7ngf5mskdk456c765t201', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 09:55:04', NULL),
(781, 'k9o71dq9dlkgbpi43ftk3i8mjtl52sb4', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 10:04:19', NULL),
(782, 'e9sjtha17ci1078877ls8hn2d003km8c', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 10:10:13', NULL),
(783, '595ggtqcev4f5dhe4qkfekuq79vlpsig', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 10:15:30', NULL),
(784, '9u8d41i607r4v74hlukmf134t075mklh', NULL, '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 10:19:19', NULL),
(785, 'itdh5lknd4bmjkhf66e7g7g5upqnls3a', NULL, '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 12:26:37', NULL),
(786, '7mrt0nj6t0d710to70rp62qhqmtv8u85', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 12:27:01', NULL),
(787, 'eu2bbasor33epql2ov7imsd2vcvo72bv', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 12:33:36', NULL),
(788, 'fljuulhhm3kl40l2v7anf9bsk2cs1spe', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 12:38:40', NULL),
(789, 'he5vbkkv8vave4ajhc2eouer3hg5729e', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 12:44:36', NULL),
(790, 's41luf1vp9j1lkhft73n6ngeb384053l', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 12:50:22', NULL),
(791, 'mpeqjsp2eq0b7ercf6f6c5du4lmvne0q', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 12:59:13', NULL),
(792, '5uhsu8jk8q8cj5ecds9h1uajv0q1b65u', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 13:23:47', NULL),
(793, 'pa9v1shmju1su77hd8sr0aposcrv8pmo', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 13:39:34', NULL),
(794, '3sl8b62gpd2hq73cr79mler1hopc8ecf', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 13:48:45', NULL),
(795, 'rgja5mqmfcpthnqa55ufrcne9199pfv7', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 13:51:15', NULL),
(796, 'qcv1nedtgbci0t632vbp77iamaeru09l', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 13:57:46', NULL),
(797, 'fjtei6rjfm4eb6un3uotr969ouduau8u', '8', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 14:01:21', NULL),
(798, 'km6s1f01ddcgckvo88grca7hrm5q6087', '11', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 14:04:47', NULL),
(814, 'e8h6r5a8hdk2vkhg7tn3sens0ou6jri7', '1', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 14:14:19', NULL),
(815, '4prlaknts9pkt6fa5aoosth9qu9c5qsg', NULL, '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 14:15:37', NULL),
(816, 'mr6c95desnvuqfi9n6gupv09b0kvrgdu', '11', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 14:15:43', NULL),
(817, 'fnkfgp9kuttq3oqe3nrof4mh8o5essqc', '11', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 14:22:06', NULL),
(820, 'mppjuof3eeace9fl65v3vikg6376d4tt', '1', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 14:27:09', NULL),
(821, 'qpacegpne7hqt8ubt95r54v0gtdva6vs', NULL, '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 14:27:17', NULL),
(822, 'jnmm7buf0n2n03kqef6uq5v96j0g9tte', '11', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 14:27:23', NULL),
(823, '8sgvrvsjs5gljk8h8o0g76j17jee640u', '11', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 14:39:28', NULL),
(824, 'pdh0fr9hq13c83l09rgqgap5vqs53p48', '11', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 14:43:27', NULL),
(825, '448gkm58gifpap8kqt6ngf4v2f9tls3i', '11', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 14:53:53', NULL),
(826, 'mf563mtkrnp501kltq9uf6hfgeceubdr', NULL, '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 14:58:53', NULL),
(827, 'teb4hrn0ju6duvbpgoa28kdruasihev0', '11', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 14:59:15', NULL),
(828, 'p8nempkitgbsv26mv71d0p2sqnm5gmst', '11', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 15:06:47', NULL),
(829, 'vdjia9r9a23ovbaicf0i05iphpn45gub', '11', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 15:22:27', NULL),
(830, 'a47rm3kjamsdj41jhqbo4n5b60ou84t3', '11', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 15:32:31', NULL),
(831, '0uaefrc4ecc2nnaa8vsc7b418dgn2k9k', '11', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 15:37:51', NULL),
(832, 'q91h28i994p5f5gcubqsefsj8n6jagpk', '11', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 15:43:19', NULL),
(833, 'hl2ekn21bl4oiu0qnng48j6v98e4fbde', '11', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 16:06:34', NULL),
(834, '63j3clkoe5pm8jhpr63mh940l5qpcrd1', '11', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 16:11:42', NULL),
(835, 'ltuk80ccvp94hloomss4nm2vuj87ieqj', '11', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 16:24:20', NULL),
(836, 'n44b9v4gef7bolp3c2jjal9j5nbr12ju', '11', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 16:28:37', NULL),
(837, 'siat70efm75q0r06r512qp4q0pindfjt', '11', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 16:35:00', NULL),
(838, 'mn68qbn80uj3fa2dqb7gmr2ui8t7rfuk', '11', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 16:43:06', NULL),
(839, 'b03vthra6mjnrc6gub48tjgev25oo8e6', '11', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 16:49:18', NULL),
(840, 'ibq4piurhvua3mg2qqmnskch3kauo161', '11', '::1', 'Windows 10', 'Opera', '74.0.3911.160', '2021-03-07 16:57:04', NULL),
(841, 'ruiko83mqafso2l0h087fnfavmss72t9', NULL, '::1', 'Windows 10', 'Chrome', '89.0.4389.90', '2021-03-30 15:10:35', NULL),
(842, '7omkhg9impuherr4k5e92u54fhoommij', '11', '::1', 'Windows 10', 'Chrome', '89.0.4389.90', '2021-03-30 15:14:21', NULL),
(843, 'abp3cfdee1ph7rhekkt25oebvri3mj3j', NULL, '::1', 'Windows 10', 'Chrome', '89.0.4389.114', '2021-04-02 09:42:58', NULL),
(844, 'vukfvva579t0t0njn1u8fhk5aq4rl69s', NULL, '::1', 'Windows 10', 'Opera', '74.0.3911.218', '2021-04-02 09:46:14', NULL),
(845, 'dtd3r2p1skq0a0idhs60ksjkhrbikrck', NULL, '::1', 'Windows 10', 'Opera', '75.0.3969.149', '2021-04-12 16:47:28', NULL),
(846, '4ev0dakcmatsk1gotdfjfh9fpqbj1akd', NULL, '::1', 'Windows 10', 'Chrome', '89.0.4389.114', '2021-04-13 05:56:18', NULL),
(847, 'bb2in3m3gk6i3mbslmsj7svgiq3sok5b', NULL, '::1', 'Windows 10', 'Chrome', '89.0.4389.114', '2021-04-14 11:26:31', NULL),
(848, 'vbjo2oui341d45un7i5qrasd8detp6sl', '1', '::1', 'Windows 10', 'Chrome', '89.0.4389.114', '2021-04-14 11:30:09', NULL),
(849, 'b5m5ina2rqv9j32lbcgj76n8t3ad70hk', '1', '::1', 'Windows 10', 'Chrome', '89.0.4389.114', '2021-04-14 11:41:21', NULL),
(850, '1tnjnop15cdquanj4p2cpdf4reudtk0r', '1', '::1', 'Windows 10', 'Chrome', '89.0.4389.114', '2021-04-14 11:42:03', NULL),
(851, 'tar8oe163rs02k3mk6sl3rj6fkqet8gl', '1', '::1', 'Windows 10', 'Chrome', '89.0.4389.114', '2021-04-14 11:48:13', NULL),
(852, 't9smtp7m0s5aqoicgeb031q8sjthrlhv', '1', '::1', 'Windows 10', 'Chrome', '89.0.4389.114', '2021-04-14 11:53:23', NULL),
(853, 'ia703q3munoc7te3j17464ocqic63g8n', '1', '::1', 'Windows 10', 'Chrome', '89.0.4389.114', '2021-04-14 11:59:05', NULL),
(854, '3t9um2p4me32gdqmsh8l74bou1nc3fl4', '1', '::1', 'Windows 10', 'Chrome', '89.0.4389.114', '2021-04-14 12:05:03', NULL),
(855, 'b41klenmes3rmtks50o3ao6d0vlgql7t', '1', '::1', 'Windows 10', 'Chrome', '89.0.4389.114', '2021-04-14 12:10:13', NULL),
(856, 'nimqnkipjqphardkpf2eq811u79n45gb', '1', '::1', 'Windows 10', 'Chrome', '89.0.4389.114', '2021-04-14 12:15:20', NULL),
(857, 'igj80cdgsi5k73sh1pjjb0u0at3vi85g', '1', '::1', 'Windows 10', 'Chrome', '89.0.4389.114', '2021-04-14 12:19:40', NULL),
(858, 'jnritvvb49vt0kddjtcn2d523o2qhg1e', '1', '::1', 'Windows 10', 'Chrome', '89.0.4389.114', '2021-04-14 12:40:59', NULL),
(859, 'tcbuv585678t88t6ooom7ag9d86eqcgc', '1', '::1', 'Windows 10', 'Chrome', '89.0.4389.114', '2021-04-14 12:49:26', NULL),
(860, 'lh701u3q2325fcgmq05330ilj57b236o', '1', '::1', 'Windows 10', 'Chrome', '89.0.4389.114', '2021-04-14 12:55:49', NULL),
(861, 'mv8cgujrmoi58mmuir9e7fv1unhgnq0a', '1', '::1', 'Windows 10', 'Chrome', '89.0.4389.114', '2021-04-14 13:02:18', NULL),
(862, 'dg8on2vh6m0okfrak9ggv4cpdmitihb5', '1', '::1', 'Windows 10', 'Chrome', '89.0.4389.114', '2021-04-14 13:07:44', NULL),
(863, '35siabnhj1m24lpds6b5470367imnth5', '1', '::1', 'Windows 10', 'Chrome', '89.0.4389.114', '2021-04-14 13:12:54', NULL),
(864, '4vo6qk891r52efk8vsm7lf390s8vo6f4', '1', '::1', 'Windows 10', 'Chrome', '89.0.4389.114', '2021-04-14 13:18:42', NULL),
(865, 'oq6ra0tk3se5uslah5fu2v40au6nmd4i', '1', '::1', 'Windows 10', 'Chrome', '89.0.4389.114', '2021-04-14 13:24:50', NULL),
(866, '4ttr7ubqinjbtf20kglg5ecthr230igd', '1', '::1', 'Windows 10', 'Chrome', '89.0.4389.114', '2021-04-14 13:30:11', NULL),
(867, '7o0fc4mhnck5bdff0k7khmk0bqp5am7i', '1', '::1', 'Windows 10', 'Chrome', '89.0.4389.114', '2021-04-14 13:36:58', NULL),
(868, 're43v24h8tlks98er9i2a8ar2t8n60jf', '1', '::1', 'Windows 10', 'Chrome', '89.0.4389.114', '2021-04-14 13:43:26', NULL),
(869, '9ra2pj7b6hpoe7baf1ojagbjb8b0dvun', '1', '::1', 'Windows 10', 'Chrome', '89.0.4389.114', '2021-04-14 13:49:51', NULL);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `admin_infos`
--
ALTER TABLE `admin_infos`
  ADD PRIMARY KEY (`a_id`),
  ADD UNIQUE KEY `a_email` (`a_email`);

--
-- Indexes for table `chat`
--
ALTER TABLE `chat`
  ADD PRIMARY KEY (`chat_id`);

--
-- Indexes for table `contact`
--
ALTER TABLE `contact`
  ADD PRIMARY KEY (`contact_id`),
  ADD UNIQUE KEY `contact_id` (`contact_id`);

--
-- Indexes for table `news`
--
ALTER TABLE `news`
  ADD PRIMARY KEY (`n_id`);

--
-- Indexes for table `news_comment`
--
ALTER TABLE `news_comment`
  ADD PRIMARY KEY (`n_cid`),
  ADD UNIQUE KEY `n_cid` (`n_cid`);

--
-- Indexes for table `user_activity`
--
ALTER TABLE `user_activity`
  ADD PRIMARY KEY (`aid`);

--
-- Indexes for table `user_infos`
--
ALTER TABLE `user_infos`
  ADD PRIMARY KEY (`user_id`),
  ADD UNIQUE KEY `uname` (`uname`),
  ADD UNIQUE KEY `email` (`email`);

--
-- Indexes for table `user_session`
--
ALTER TABLE `user_session`
  ADD PRIMARY KEY (`sid`),
  ADD UNIQUE KEY `session_id` (`session_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `admin_infos`
--
ALTER TABLE `admin_infos`
  MODIFY `a_id` int(5) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `chat`
--
ALTER TABLE `chat`
  MODIFY `chat_id` int(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=79;

--
-- AUTO_INCREMENT for table `contact`
--
ALTER TABLE `contact`
  MODIFY `contact_id` int(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `news`
--
ALTER TABLE `news`
  MODIFY `n_id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=53;

--
-- AUTO_INCREMENT for table `news_comment`
--
ALTER TABLE `news_comment`
  MODIFY `n_cid` int(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=22;

--
-- AUTO_INCREMENT for table `user_activity`
--
ALTER TABLE `user_activity`
  MODIFY `aid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=1398;

--
-- AUTO_INCREMENT for table `user_infos`
--
ALTER TABLE `user_infos`
  MODIFY `user_id` int(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- AUTO_INCREMENT for table `user_session`
--
ALTER TABLE `user_session`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=870;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
